{"main_page": "https://arxiv.org/abs/2510.17906", "pdf": "https://arxiv.org/pdf/2510.17906", "title": "Title:\n          Imaging and Polarimetric Signatures of Konoplya-Zhidenko Black Holes with Various Thick Disk", "authors": "Xinyu Wang, Yukang Wang, Xiao-Xiong Zeng", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "We investigate the imaging properties of spherically symmetric Konoplya-Zhidenko (KZ) black holes surrounded by geometrically thick accretion flows, adopting a phenomenological radiatively inefficient accretion flow (RIAF) model and an analytical ballistic approximation accretion flow (BAAF) model. General relativistic radiative transfer is employed to compute synchrotron emission from thermal electrons and generate horizon-scale images. For the RIAF model, we analyze the dependence of image morphology on the deformation parameter, observing frequency, and flow dynamics. The photon ring and central dark region expand with increasing deformation parameter, with brightness asymmetries arising at high inclinations and depending on flow dynamics and emission anisotropy. The BAAF disk produces narrower rings and darker centers, while polarization patterns trace the brightness distribution and vary with viewing angle and deformation, revealing spacetime structure. These results demonstrate that intensity and polarization in thick-disk models provide probes of KZ black holes and near-horizon accretion physics."}
{"main_page": "https://arxiv.org/abs/2510.17907", "pdf": "https://arxiv.org/pdf/2510.17907", "title": "Title:\n          A Cost-Effective Search for Extraterrestrial Probes in the Solar System", "authors": "Beatriz Villarroel, Wesley A. Watters, Alina Streblyanska, Enrique Solano, Stefan Geier, Lars Mattsson", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "For centuries, astronomers have discussed the possibility of inhabited worlds - from Herschel's 18th-century observations suggesting Mars may host life, to the systematic search for technosignatures that began in the 1960s using radio telescopes. Searching for artifacts in the solar system has received relatively little formal scientific interest and has faced significant technical and social challenges. Automated surveys and new observational techniques developed over the past decade now enable astronomers to survey parts of the sky for anomalous objects. We briefly describe four methods for detecting extraterrestrial artifacts and probes within the Solar System and then focus on demonstrating one of these. The first makes use of pre-Sputnik images to search for flashes from glinting objects. The second method makes use of space-borne telescopes to search for artificial objects. A third approach involves examining the reflectance spectra of objects in Earth orbit, in search of the characteristic reddening that may imply long-term exposure of metallic surfaces to space weathering. We focus here on a fourth approach, which involves using Earth's shadow as a filter when searching for optically luminous objects in near-Earth space. We demonstrate a proof-of-concept of this method by conducting two searches for transients in images acquired by the Zwicky Transient Facility (ZTF), which has generated many repeated 30-second exposures of the same fields. In this way, we identified previously uncatalogued events at short angular separations from the center of the shadow, motivating more extensive searches using this technique. We conclude that the Earth's shadow presents a new and exciting search domain for near-Earth SETI."}
{"main_page": "https://arxiv.org/abs/2510.17911", "pdf": "https://arxiv.org/pdf/2510.17911", "title": "Title:\n          Charged liquid surface instabilities and detection of Solar neutrino by XENONnT", "authors": "Sergey Pereverzev", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Other Condensed Matter (cond-mat.other)", "abstract": "Announcement of detection of Solar 8B neutrinos by XENONnT dual-phase detector come with a suite of unexplained detector effects. We expect accumulation of surface charges and charged surface instability resulting in maximal surface elevation and charge density at wire crossing regions, where anomalies were observed. Thou data from these regions were excluded from analysis, surface distortions and charges are present everywhere, which can lead to large systematic errors in small signal detection."}
{"main_page": "https://arxiv.org/abs/2510.17926", "pdf": "https://arxiv.org/pdf/2510.17926", "title": "Title:\n          Exploring Giant Planet Atmospheres with Habitable Worlds Observatory", "authors": "Leigh N. Fletcher, Amy Simon, Michael H. Wong, Jonathan D. Nichols, Nick A. Teanby, Conor A. Nixon, Marina Galand", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Visible and ultraviolet imaging and spectroscopy of Solar System giant planets can set the paradigm for the atmospheric, ionospheric, and magnetospheric processes shaping the diversity of giant exoplanets, brown dwarfs, and their interactions with stellar hosts. Spectra of their molecular absorptions, aerosol scattering, airglow, and auroral emissions can reveal these dynamic atmospheres in three dimensions. Given that giant planets are extended, bright, moving, and rotating objects, with extreme dynamic range and highly variable appearances, they impose specific mission and instrumentation requirements on future large space-based optical/UV observatories like the proposed Habitable Worlds Observatory (HWO). We advocate that HWO must have the capability to track non-sidereal targets like the giant planets and their satellites; should be able to view auroras and atmospheres without saturation (e.g., through the use of filters or fast read-out modes); and with a high dynamic range to explore faint objects near bright discs. HWO should enable spatially-resolved spectroscopy from $\\sim80$ nm to $\\sim900$ nm, capturing H$_2$ Lyman and Werner band series and H Lyman-$\\alpha$ in the far-UV; molecular absorptions and scattering in the mid-UV/visible; and deep hydrogen/methane absorptions in the 800-900 nm for cloud characterisation and CH$_4$ mapping. Imaging should enable time-resolved observations, from seconds to create auroral movies, to hours for cloud tracking and winds, to months and years for atmosphere/ionosphere variability. We advocate that an imager should have sufficient field of view to capture Jupiter ($>50$\\arcsec), and that UV/visible integral field spectrographs be considered with both narrow ($3$\\arcsec) and wide ($>10$\\arcsec) field capabilities to provide efficient mapping of atmospheres and auroras. [Abbr]"}
{"main_page": "https://arxiv.org/abs/2510.17927", "pdf": "https://arxiv.org/pdf/2510.17927", "title": "Title:\n          Comission Femmes et Astronomie de la SF2A : Women participation in french astronomy 2025", "authors": "N. Lagarde, R.-M. Ouazzani, J. Malzac, M. Clavel, P. de Laverny, L. Leboulleux, I. Vauglin, C. Bot, S. Brau-Nogué, L. Ciesla, E. Josselin, N. Nesvadba, O. Venot", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "The Commission Femmes et Astronomie of the French Astronomical Society, has conducted a statistical study aimed at mapping the current presence of women in French professional astronomy and establishing a baseline for tracking its evolution over time. This study follows an initial survey carried out in 2021, which covered eight astronomy and astrophysics institutes (1,060 employees). This year, the scope was expanded to 11 institutes, bringing together a total of 1,525 employees, including PhD students, postdoctoral researchers, academics, as well as technical and administrative staff, representing about 57% of the whole French community. We examined how the proportion of women varies according to career stage, level of responsibility, job security, and income. The results are compared to the 2021-2022 survey and appear to illustrate the well-known \"leaky pipeline\", with one of the main bottlenecks being access to permanent positions. The study shows that the proportion of women consistently declines with increasing job security, career seniority, qualification level, and salary."}
{"main_page": "https://arxiv.org/abs/2510.17952", "pdf": "https://arxiv.org/pdf/2510.17952", "title": "Title:\n          Evolutionary Tracks and Spectral Properties of Quasi-stars and Their Correlation with Little Red Dots", "authors": "Andrew D. Santarelli, Ebraheem Farag, Earl P. Bellinger, Priyamvada Natarajan, Rohan P. Naidu, Claire B. Campbell, Matthew E. Caplan", "subjects": "Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "JWST has revealed a population of red, compact, high-redshift (${z\\sim3-10}$) objects referred to as ``Little Red Dots'' (LRDs). These objects exhibit unusual spectral features reminiscent of stellar spectra with blackbody-like SEDs, large hydrogen Balmer breaks, Balmer line absorption, and classical stellar absorption features such as calcium H&K and the calcium triplet. Following the recent suggestion that these may be actively accreting direct-collapse black holes in the process of assembly, i.e. quasi-stars, we present evolutionary models of quasi-stars using our recently released, publicly available MESA-QUEST modeling framework. We compute a grid of models spanning a range of black hole masses and predict the luminosities, temperatures, surface gravities, and lifetimes of these objects. We find that these models lie along a Hayashi track once they hit their ``late-stage'' which constitutes the majority of their lives ($\\sim 20$~Myr). We present scaling relations for estimating the mass of a quasi-star as a function of the bolometric luminosity, as well as the bolometric luminosity as a function of the effective temperature for the Hayashi track. The short lifetimes in tandem with the observed number density of LRDs imply the possibility that every supermassive black hole was once a quasi-star. We compare synthetic spectra of our quasi-star models to observations of LRDs, and show that these models are broadly capable of reproducing the continuum spectra of observed LRDs. These results indicate that quasi-stars are promising candidates for the origin of supermassive black holes via direct collapse in the early universe."}
{"main_page": "https://arxiv.org/abs/2510.17955", "pdf": "https://arxiv.org/pdf/2510.17955", "title": "Title:\n          Sub-Snowline Formation of Gas-Giant Planets in Binary Systems", "authors": "Ilay Kamai, Hagai B. Perets, Jakob Stegmann, Evgeni Grishin", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Giant planets are thought to build their cores beyond the snow line, where water ice solids catalyze efficient planetary core growth \\citep{Pollack1996, Armitage2024}. In close binary star systems, however, the companion star's gravity shrinks the region where orbits are long-term stable \\citep[]{Holman1999}, effectively excluding the zone where giants should form. Nevertheless, here we show that such systems exist and are not rare. Among 393 binary systems with measured orbits and circumstellar gas giants, we identify 19 for which the snowline region is unstable. The distribution of their metallicities and eccentricities is consistent with the background population, making a capture origin or enhanced solids abundance unlikely causes for their formation. Instead, we show that the sub-snowline formation paradox can be resolved by the tidal torque from the companion, which truncates the protoplanetary disk and creates a pressure bump and effective dust trap that facilitates the formation of gas giants. Using this model, we can successfully predict the observed locations of gas giants from their host binary properties. Moreover, the main inconsistent outliers from these predictions are found to be evolved stellar systems (white dwarfs or red-giant stars), further supporting the model and pointing to these being second-generation planets. Our results have therefore key implications for understanding planet formation processes and provide observational support for sub-snowline gas-giant formation and the role of trap-dusts in their formation."}
{"main_page": "https://arxiv.org/abs/2510.17956", "pdf": "https://arxiv.org/pdf/2510.17956", "title": "Title:\n          Using Strong Lensing to Detect Subhalos with Steep Inner Density Profiles", "authors": "Kassidy E. Kollmann, James W. Nightingale, Mariangela Lisanti, Andrew Robertson, Oren Slone", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph)", "abstract": "The inner region of a subhalo's density distribution is particularly sensitive to dark matter microphysics, with alternative dark matter models leading to both cored and steeply-rising inner density profiles. This work investigates how the lensing signature and detectability of dark matter subhalos in mock HST-, Euclid-, and JWST-like strong lensing observations depends on the subhalo's radial density profile, especially with regards to the inner power-law slope, $\\beta$. We demonstrate that the minimum-mass subhalo detectable along the Einstein ring of a system is strongly dependent on $\\beta$. In particular, we show that subhalos with $\\beta \\sim 2.2$ can be detected down to masses over an order-of-magnitude lower than their Navarro-Frenk-White (NFW) counterparts with $\\beta \\sim 1$. Importantly, we find that the detectability of subhalos with steep inner profiles is minimally affected by increasing the complexity of the main lens galaxy's mass model. This is a unique characteristic of these subhalos, as those with NFW or shallower profiles become essentially undetectable when multipole perturbations are added to the lens model. The results of this work highlight how the underlying dark matter physics can significantly impact the expected number of subhalo detections from strong gravitational lensing observations. This is important for testing Cold Dark Matter against alternatives, such as Self-Interacting Dark Matter, which predict the existence of subhalos with diverse inner density profiles."}
{"main_page": "https://arxiv.org/abs/2510.17957", "pdf": "https://arxiv.org/pdf/2510.17957", "title": "Title:\n          The Silent Majority: The Interacting Post-Common-Envelope Binaries Underlying Cataclysmic Variables", "authors": "Yarin Meir Shani, Na'ama Hallakoun, Sagi Ben-Ami, Sahar Shahaf, Jiadong Li, Hans-Walter Rix, Silvia Toonen", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "We analyze the orbital period distribution of post-common-envelope white-dwarf-main-sequence (WDMS) binaries by cross-matching the new spectroscopic Gaia DR3 WDMS catalog with TESS light curves, and applying a uniform periodicity search and vetting pipeline. We identify 107 periodic systems, including 74 eclipsing binaries (32 new) and 33 binaries exhibiting only sinusoidal variations. Injection-recovery tests and a forward detectability model yield a completeness-corrected distribution that is well-described by a two-component function: a log-period Gaussian peaking at $P_{\\rm orb} \\approx 4.1 $ h with $\\sigma \\approx 1.8$ h, plus a rising component that begins near $P_{\\rm orb}\\approx12.9$ h. We refer to this extended component as the long-period tail. It consists exclusively of detached non-interacting post-common-envelope binaries (PCEBs) that likely emerged from the common envelope and have not yet initiated mass transfer. In contrast, the short-period Gaussian is dominated by interacting or near-contact systems (including 22 known cataclysmic variables), consistent with high Roche-lobe filling factors. From the completeness-corrected distribution we infer that $29.8\\%\\pm4.5\\%$ of the spatially unresolved WDMSs in our parent catalog are close PCEBs. Binary population synthesis models with high common-envelope efficiencies overproduce long-period systems and fail to reproduce the sharp peak, whereas lower efficiencies ($\\alpha\\lambda \\leq 0.3$) match the peak more closely, yet still underpredict the tail. Our results hint at a large, currently under-classified reservoir of pre-cataclysmic variables and weakly accreting binaries, and provide new constraints on common-envelope physics."}
{"main_page": "https://arxiv.org/abs/2510.17958", "pdf": "https://arxiv.org/pdf/2510.17958", "title": "Title:\n          Attributing the O'Connell effect in contact binaries to a cooling mass-transfer stream", "authors": "Matthias Fabry, Andrej Prša", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Contact binaries are very short-period systems that are continuously interacting by transferring mass and energy. Obtaining large, statistical samples of contact binaries from photometric surveys can put valuable constraints on the various processes involved in their evolution. Modeling those systems however present some challenges. In some contact-binary light curves, the O'Connell effect is visible, where the maxima at both quarter phases are unequal. In the literature, this effect is typically attributed to magnetic spots on the surface of the binary. In this work, we model contact-binary surfaces using PHOEBE, and include a parametric prescription for a lateral mass- and energy-transfer stream that travels from the hotter primary to the cooler secondary. We allow this stream to have a variable heat capacity. We fit a system from the Kepler sample with a strong O'Connell effect, and show that a low-heat capacity stream can explain the unequal maxima. This suggests that, in such systems, surface flows can play a significant role in transferring heat between components. Our methods can be used on larger samples of contact binaries from OGLE, Kepler, or TESS to advance our understanding of contact binary structure and evolution."}
{"main_page": "https://arxiv.org/abs/2510.17959", "pdf": "https://arxiv.org/pdf/2510.17959", "title": "Title:\n          Universal Spectral Tokenization via Self-Supervised Panchromatic Representation Learning", "authors": "Jeff Shen, Francois Lanusse, Liam Holden Parker, Ollie Liu, Tom Hehir, Leopoldo Sarra, Lucas Meyer, Micah Bowles, Sebastian Wagner-Carena, Sebastian Wagner-Carena, Helen Qu, Siavash Golkar, Alberto Bietti, Hatim Bourfoune, Nathan Cassereau, Pierre Cornette, Keiya Hirashima, Geraud Krawezik, Ruben Ohana, Nicholas Lourie, Michael McCabe, Rudy Morel, Payel Mukhopadhyay, Mariel Pettee, Bruno Régaldo-Saint Blancard, Kyunghyun Cho, Miles Cranmer, Shirley Ho", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)", "abstract": "Sequential scientific data span many resolutions and domains, and unifying them into a common representation is a key step toward developing foundation models for the sciences. Astronomical spectra exemplify this challenge: massive surveys have collected millions of spectra across a wide range of wavelengths and resolutions, yet analyses remain fragmented across spectral domains (e.g., optical vs. infrared) and object types (e.g., stars vs. galaxies), limiting the ability to pool information across datasets. We present a deep learning model that jointly learns from heterogeneous spectra in a self-supervised manner. Our universal spectral tokenizer processes spectra from a variety of object types and resolutions directly on their native wavelength grids, producing intrinsically aligned, homogeneous, and physically meaningful representations that can be efficiently adapted to achieve competitive performance across a range of downstream tasks. For the first time, we demonstrate that a single model can unify spectral data across resolutions and domains, suggesting that our model can serve as a powerful building block for foundation models in astronomy -- and potentially extend to other scientific domains with heterogeneous sequential data, such as climate and healthcare."}
{"main_page": "https://arxiv.org/abs/2510.17960", "pdf": "https://arxiv.org/pdf/2510.17960", "title": "Title:\n          AION-1: Omnimodal Foundation Model for Astronomical Sciences", "authors": "Liam Parker, Francois Lanusse, Jeff Shen, Ollie Liu, Tom Hehir, Leopoldo Sarra, Lucas Meyer, Micah Bowles, Sebastian Wagner-Carena, Helen Qu, Siavash Golkar, Alberto Bietti, Hatim Bourfoune, Nathan Casserau, Pierre Cornette, Keiya Hirashima, Geraud Krawezik, Ruben Ohana, Nicholas Lourie, Michael McCabe, Rudy Morel, Payel Mukhopadhyay, Mariel Pettee, Bruno Regaldo-Saint Blancard, Kyunghyun Cho, Miles Cranmer, Shirley Ho", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "While foundation models have shown promise across a variety of fields, astronomy still lacks a unified framework for joint modeling across its highly diverse data modalities. In this paper, we present AION-1, a family of large-scale multimodal foundation models for astronomy. AION-1 integrates heterogeneous imaging, spectroscopic, and scalar data using a two-stage architecture: modality-specific tokenization followed by transformer-based masked modeling of cross-modal token sequences. The model is pretrained on five large-scale surveys: Legacy Survey, Hyper Suprime-Cam (HSC), Sloan Digital Sky Survey (SDSS), Dark Energy Spectroscopic Instrument (DESI), and Gaia. These span more than 200 million observations of stars, galaxies, and quasars. With a single frozen encoder, AION-1 achieves strong results on a broad suite of downstream tasks, including galaxy and stellar property estimation, galaxy morphology classification, similarity-based retrieval, galaxy image segmentation, and spectral super-resolution. We release AION-1 model variants ranging from 300 M to 3.1 B parameters. Beyond astronomy, AION-1 provides a scalable blueprint for multimodal scientific foundation models that can seamlessly integrate noisy, instrument-specific observations. All code, tokenizers, pretrained weights, and a lightweight evaluation suite are released under an open-source license."}
{"main_page": "https://arxiv.org/abs/2510.17963", "pdf": "https://arxiv.org/pdf/2510.17963", "title": "Title:\n          Contact-binary evolution with energy transfer and saturated magnetic braking", "authors": "Matthias Fabry, Andrej Prša", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "The evolution of low-mass contact binaries is influenced by angular-momentum loss, mass and energy transfer, and the nuclear evolution of the components. They have periods shorter than one day, and we expect their period evolution to be dominated by magnetic braking. Evidence for saturated magnetic braking was presented by studying the period distribution of detached eclipsing binaries. This means the strength of magnetic braking likely does not cause a steep period-shrinking relation derived from the widely used Skumanich law. We find further evidence for saturated magnetic braking by considering evolutionary models of low-mass contact binaries. We also show that energy transfer must play an important role over a wide parameter range in producing the observed low mass ratios of contact binaries."}
{"main_page": "https://arxiv.org/abs/2510.17966", "pdf": "https://arxiv.org/pdf/2510.17966", "title": "Title:\n          Looking for Companionship: Radial Velocity Follow-Up of Lithium-Rich Giants with ESPRESSO", "authors": "Maryum Sayeed, Andrew R. Casey, Benjamin T. Montet, Melissa K. Ness, Adrian M. Price-Whelan, Daniel Huber, Madeline J. Maldonado Gutierrez", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Lithium-rich red giants have been a long-standing mystery in stellar astrophysics. A leading theory to explain these chemically peculiar and rare objects is interactions with a close companion. To investigate their companion fraction, we collected high-resolution spectra of 33 Li-rich red giants using ESPRESSO, and used The Joker constrain their orbital parameters. We find an overall companion rate of $27\\%$ (9/33). Secondary masses reveal one planetary companion ($ M\\sin i \\approx 7 \\; \\rm M_{Jup}$), three brown dwarfs ($ M\\sin i=30-33 \\; \\rm M_{Jup}$), and five stellar-mass companions ($M\\sin i= 0.2-0.8 \\;\\rm M_\\odot$). Our findings suggest that Li-rich red giants with lower lithium abundance ($\\rm A(Li) \\approx 1.5 \\; dex$) tend to be in binaries as compared to those with higher lithium abundance, and Li-rich red giants with $\\log g = 2-3 \\rm \\; dex$ have a higher companion rate than those outside of this range. We offer two potential formation mechanisms of our Li-rich sample: (i) the progenitor mass of stellar mass companions suggest that these objects were potentially lithium-producing, intermediate-mass AGB stars; (ii) the sub-stellar companions were initially in multi-planet systems, but dynamical instability caused the tidal dissipation of close-in planets thereby enhancing the red giant in lithium. Extended baselines and dedicated follow-up with Gaia DR4 astrometry are required to confirm the orbital parameters of our systems and distinguish between mechanisms."}
{"main_page": "https://arxiv.org/abs/2510.17968", "pdf": "https://arxiv.org/pdf/2510.17968", "title": "Title:\n          Rise of the forsaken relics: connecting present-day stellar streams and phase-mixed galaxies to the Epoch of Reionization", "authors": "Aritra Kundu, Robyn Sanderson, Adam Lidz, Pratik J. Gandhi, Andrew Wetzel, Robert Feldmann, Nondh Panithanpaisal, Jasjeev Singh, Michael Boylan-Kolchin", "subjects": "Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The `near-far' approach to studying reionization leverages the star formation histories of the Milky Way (MW) or Local Group (LG) galaxies, derived from resolved photometry, to infer the low-mass/faint-end of the stellar mass functions (SMFs) or the ultraviolet luminosity functions (UVLFs) of high-redshift galaxies ($z \\gtrsim 6$), beyond the current JWST detection limits ($M_{\\mathrm{UV}} \\gtrsim -15$). Previous works considered only intact low-mass galaxies in the MW and LG, neglecting disrupted galaxies such as stellar streams and phase-mixed objects. Using the FIRE-2 simulations, we show that these disrupted galaxies contribute up to $\\sim50\\%$ of the total stellar mass budget of the proto-MW/LG at $z =6-9$. Including all the progenitors of these disrupted galaxies improves the normalization of the recovered SMFs/UVLFs by factors of $\\sim2-3$ and reduces the halo-to-halo variation in the slope by $\\sim20-40\\%$. This enables robust constraints down to at least the resolution limit of the simulations, near $M_\\star$ $\\sim$ $10^{5}$ $M_\\odot$ or $M_{\\mathrm{UV}} \\sim -10$ at $z \\gtrsim 6$. We also show that `fossil record' reconstructions - which assume each present-day system descends from a single reionization-era progenitor - are sensitive to the stellar mass/UV magnitude thresholds, which introduces bias in the inferred low-mass/faint-end slopes. Additionally, we demonstrate that neglecting disrupted systems underestimates the contribution of galaxies with $M_{\\mathrm{UV}} \\lesssim -15$ to the reionization-era UV luminosity density. Finally, we estimate that a significant fraction ($\\sim50\\%$) of streams with $M_\\star$ $\\gtrsim$ $10^{6}$ $M_\\odot$ at $z=0$ should be detectable from upcoming Rubin Observatory and Roman Space Telescope observations."}
{"main_page": "https://arxiv.org/abs/2510.17970", "pdf": "https://arxiv.org/pdf/2510.17970", "title": "Title:\n          Investigating the mysterious nature of 1LHAASO J1740+0948u through deep XMM-Newton observations", "authors": "G. Brunelli, G. Ponti, H. Zhang, E. de Oña Wilhelmi, V. Sguera, C. Vignali, R. Zanin", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "1LHAASO J1740+0948u is a very-high-energy (VHE) source reported by LHAASO, with no counterpart at other wavelengths. It is located at 0.2° from PSR J1740+1000, a radio and gamma-ray pulsar placed well above the Galactic plane, which displays an X-ray tail. Despite the offset, the association between the two sources is likely. We aim to study the diffuse X-ray emission around PSR J1740+1000 and its tail to investigate the origin of 1LHAASO J1740+0948u through a multi-wavelength SED fitting, testing different scenarios. We analysed ~500 ks of XMM-Newton observations and studied for the first time the diffuse emission around the pulsar. We also analysed the tail and how its emission evolves as a function of distance. We then performed a fit of the SED, including the spectrum of 1LHAASO J1740+0948u and the X-ray data obtained from either the analysis of the tail or the diffuse emission, to understand whether one of the two X-ray sources could be related to the TeV emission and attempt a source classification. The diffuse X-ray emission analysis resulted in upper limits in the 0.5-10 keV range. The tail is best fitted with a power law with $\\Gamma=1.76\\pm0.06$ in 0.5-8 keV, with no significant detection of spectral variations with distance. We do not find a good SED fit that can explain both the X-ray tail and the LHAASO spectrum with reasonable parameters, suggesting that the TeV emission likely comes from an older X-ray-faint electron population. We then performed an SED fitting of the VHE spectrum combined with the upper limits on the diffuse emission, constraining the magnetic field to be as low as $B\\leq1.2 \\mu$G. We suggest that 1LHAASO J1740+0948u could represent either the relic PWN of PSR J1740+1000 or its pulsar halo. Our energy density results hint at a halo-like nature for 1LHAASO J1740+0948u, but deeper multi-wavelength observations are required to confirm this hypothesis."}
{"main_page": "https://arxiv.org/abs/2510.17973", "pdf": "https://arxiv.org/pdf/2510.17973", "title": "Title:\n          Fragmentation Cross Sections for the Understanding of Cosmic-Ray Transport in the Galaxy: Results and Prospects from NA61/SHINE", "authors": "Michael Unger (for the NA61/SHINE Collaboration)", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Accurate measurements of cosmic-ray fragmentation cross sections are essential for maximizing the physics potential of precise measurements of secondary and primary cosmic-ray fluxes from current balloon and space-borne experiments. NA61/SHINE, operating at the CERN SPS H2 beamline, is uniquely suited to studying these interactions at energies above 10 GeV/c per nucleon. In this contribution, we present the fragmentation cross sections for the breakup of carbon into $^{10}$B, $^{11}$B and $^{11}$C at 13.5 GeV/c per nucleon that are needed for interpreting the cosmic-ray boron-to-carbon ratio. These results are based on data from a pilot run conducted in 2018. We also give an overview of the high-statistics data-taking campaign in 2024, which covered projectile nuclei from lithium to silicon. With over 40 million recorded beam triggers, this data set will enable the reconstruction of the full reaction network required to study light secondary cosmic rays. Furthermore, we report on data collected in 2025 with a primary oxygen beam at 150 GeV/c per nucleon, aimed at verifying the expected flattening of fragmentation cross sections at high energies."}
{"main_page": "https://arxiv.org/abs/2510.17977", "pdf": "https://arxiv.org/pdf/2510.17977", "title": "Title:\n          Growth of Structure in Multi-species Wave Dark Matter", "authors": "Mustafa A. Amin, M. Sten Delos", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We explore the growth of structure in multi-species wave (and particle) dark matter. We derive the evolution of the power spectrum of total density contrasts for an arbitrary number of component species, density fractions, and initial field power spectra. We also derive cross-spectra for density correlations across or within individual species. Our framework includes cold and warm wave dark matter, which can give rise to significant intrinsic Poisson-like density fluctuations along with scale-dependent evolution connected to the free-streaming and Jeans scales. Such dark matter components could be globally or locally misaligned scalar fields as well as multi-component fields with spin $>0$. The framework also includes cold and warm particle dark matter in the appropriate limits."}
{"main_page": "https://arxiv.org/abs/2510.17980", "pdf": "https://arxiv.org/pdf/2510.17980", "title": "Title:\n          FLAMINGO: Tracing the co-evolution of hot gas and black holes in galaxy groups and clusters", "authors": "Emily E. Costello, Ian G. McCarthy, Jaime Salcido, John C. Helly, Robert J. McGibbon, Matthieu Schaller, Joop Schaye", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The gas mass fraction of galaxy groups and clusters is a key physical quantity for constraining the impact of feedback processes on large-scale structure. While several modern cosmological simulations use the gas fraction-halo mass relation to calibrate their feedback implementations, we note that this relation exhibits substantial intrinsic scatter whose origin has not been fully elucidated. Using the large-volume FLAMINGO hydrodynamical simulations, we examine the role of both central and satellite supermassive black holes (BHs) in shaping this scatter, probing higher halo masses than previously possible. For haloes with M500 < 10^13 Msun, we find that central BH mass correlates strongly and negatively with gas fraction, such that higher BH masses give rise to lower gas fractions at fixed halo mass, consistent with previous studies. Interestingly, however, for 10^13 Msun < M500 < 10^14.5 Msun the correlation reverses and becomes positive, with overmassive BHs residing in haloes with above-average gas fractions. By tracing progenitor BHs and haloes through cosmic time, we show that this behaviour is driven by the expulsion and subsequent re-accretion of halo gas, regulated by the timing of BH growth and feedback. Specifically, haloes that collapse earlier form BHs earlier, leading to earlier gas expulsion and re-accretion and a high gas fraction compared to haloes of the same present-day mass that formed later. Our results demonstrate that present-day scatter in the gas fraction-halo mass relation is strongly shaped by the early growth history of BHs and their haloes, a prediction that can be tested with future observational measurements."}
{"main_page": "https://arxiv.org/abs/2510.17985", "pdf": "https://arxiv.org/pdf/2510.17985", "title": "Title:\n          Exogeological inferences from white dwarf pollutants: the impact of stellar physics", "authors": "Andrew M. Buchan (1), Pier-Emmanuel Tremblay (1), Antoine Bédard (1), Evan B. Bauer (2 and 3), Tim Cunningham (3) ((1) Department of Physics, University of Warwick, (2) Lawrence Livermore National Laboratory, (3) Center for Astrophysics, Harvard and Smithsonian)", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Many white dwarfs have accreted material from their own planetary systems. These objects can be used to infer the composition of exoplanetary material and identify evidence for key geological processes. However, the white dwarf atmospheric physics distorts the inferred material composition away from the true composition, mainly through differential atomic diffusion of the accreted metals. Correcting for this effect is essential, but is dependent on various physical assumptions associated with the white dwarf itself. We first focus on the effect of assumptions related to convective overshoot and thermohaline mixing on the atomic diffusion timescales. For white dwarfs with H-dominated atmospheres between 12000 K and 18000 K, we find that including a complete treatment of convective overshoot decreases the inferred Fe and O abundances in accreted material. For these white dwarfs, we also find that including thermohaline mixing decreases Fe and O abundances. For He-dominated systems, the effect of convective overshoot is comparatively minor. We then explore the overall effect of other physical assumptions by comparing publicly available grids of diffusion timescales. We find that the choice of model grid can have a large impact for white dwarfs with He-dominated atmospheres, notably on the inferred core to mantle ratio of accreted material. We identify several systems for which the geological interpretation is robust against these systematics. We also present a `discrepancy metric' which can be used to estimate the potential impact of changing the stellar physics without requiring detailed modelling."}
{"main_page": "https://arxiv.org/abs/2510.17987", "pdf": "https://arxiv.org/pdf/2510.17987", "title": "Title:\n          Piling up in the darkness: Features of the BBH mass distribution from isolated binaries", "authors": "Cristiano Ugolini", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "After the third LIGO--Virgo--KAGRA observing run, the number of detected binary black hole (BBH) mergers became sufficient to identify statistical features of the population. We explore how different prescriptions for the final fate of massive stars and key binary-evolution processes shape isolated binaries and their remnants. Using \\textsc{sevn}, we evolved $10^{7}$ binaries across 15 metallicities, 3 core-collapse supernova models, 4 PPISN models, and 6 common-envelope (CE) prescriptions, for a total of 990 runs ($9.9 \\times 10^{9}$ systems). Both single- and binary-star physics shape the BH mass distribution: single-star processes control the high-mass tail ($M_{\\rm BH} \\geq 45M_{\\odot}$), while binary evolution produces pile-ups in specific intervals. In particular, the bump at $\\sim 35 M_{\\odot}$, often attributed to PPISNe, also emerges from binaries evolving only through stable mass transfer, without CE. Finally, we test a top-heavy IMF, finding it boosts merger numbers and alters the abundance of systems with a given primary BH mass."}
{"main_page": "https://arxiv.org/abs/2510.17996", "pdf": "https://arxiv.org/pdf/2510.17996", "title": "Title:\n          Testing the Stellar Feedback-driven Breathing Mode in Low-mass Galaxies with Gas Kinematics", "authors": "Yifei Luo, Joseph Wick, Alexie Leauthaud, Andrew Wetzel, Tucker Jones, Erin Kado-Fong, Song Huang, Xinjun Chen, Conghao Zhou, Jiaxuan Li", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Hydrodynamic simulations have proposed that stellar feedback and bursty star-formation can produce dark matter cores in low-mass galaxies. A key prediction is that feedback-driven gas outflow and inflow cycles can lead to ``breathing modes'' (rapid fluctuations in the global gravitational potential) which drive correlated variations in galaxy size, kinematics, and star-formation rate. In this paper, we test the dynamical effects of feedback-driven breathing modes using a sample of 103 star-forming low-mass galaxies with stellar masses between $7.9<\\rm \\log M_*/M_\\odot<9.6$ and $0.02<z<0.19$. We measure ionized gas velocity dispersions from H$\\alpha$ emission lines and compare them to mock observations from the FIRE-2 simulations. We compare gas velocity dispersions ($\\rm \\sigma_{gas}$), stellar masses, and specific star-formation rates (sSFR). We find a positive correlation between gas velocity dispersion residuals at fixed stellar masses ($\\rm \\Delta\\sigma_{gas}$) and sSFR in both data and simulations. However, the relation is tighter in FIRE-2 compared to the data. FIRE-2 produces more low-sSFR galaxies compared to our observational sample, however, the sSFR distributions agree after limiting both samples to a minimum sSFR. A deeper and more complete photometric sample further indicates that observed low-mass galaxies could span the full range of sSFR predicted in the FIRE-2 simulations. Our results support the existence of short-timescale dynamical effects driven by gas outflow and inflow cycles in low-mass galaxies and motivate additional tests of the breathing mode."}
{"main_page": "https://arxiv.org/abs/2510.18006", "pdf": "https://arxiv.org/pdf/2510.18006", "title": "Title:\n          Formation Of Sub-Structure In Luminous Submillimeter galaxies (FOSSILS): Evidence of Multiple Pathways to Trigger Starbursts in Luminous Submillimeter Galaxies", "authors": "Ryota Ikeda, Daisuke Iono, Ken-ichi Tadaki, Maximilien Franco, Min S. Yun, Jorge A. Zavala, Yoichi Tamura, Takafumi Tsukui, Christina C. Williams, Bunyo Hatsukade, Minju M. Lee, Tomonari Michiyama, Ikki Mitsuhashi, Kouichiro Nakanishi, Caitlin M. Casey, Soh Ikarashi, Kianhong Lee, Yuichi Matsuda, Toshiki Saito, Andrea Silva, Hideki Umehata, Hidenobu Yajima", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We present an analysis of rest-frame optical and far-infrared continuum emission in three luminous submillimeter galaxies (SMGs) at $3.0\\lesssim z\\lesssim4.5$. The SMGs are spatially resolved down to 400-500 pc ($\\sim0.05$'') resolution by James Webb Space telescope (JWST) and Atacama Large Millimeter/submillimeter Array (ALMA) observations. Despite similarities in their observed far-infrared properties (flux density, infrared luminosity, and effective radius), the three SMGs exhibit heterogeneous morphologies both across wavelengths and among the sources themselves. While two of them (AzTEC-4 and AzTEC-8) show a disk-like structure in optical continuum, AzTEC-1 is dominated by highly concentrated component with the Sérsic index of $n=5.4$, where its far-infrared continuum emission is clumpy and less concentrated. AzTEC-4, which is confirmed to be at $z=4.198$, shows a two-arm spiral of dust, but not in the stellar distribution. These three SMGs exemplify that multiple physical mechanisms exist in triggering starbursts in luminous SMGs at high redshift: secular instability in gas disks (AzTEC-4) in addition to possible minor mergers (AzTEC-8), and a combination of the efficient gas supply to the central core induced by a gas-rich major merger and the reformation of cold gas disk (AzTEC-1)."}
{"main_page": "https://arxiv.org/abs/2510.18011", "pdf": "https://arxiv.org/pdf/2510.18011", "title": "Title:\n          Cosmic shear with one component and its application to future radio surveys", "authors": "Yu-Hsiu Huang, Elisabeth Krause, Tim Eifler, Gary Bernstein, Jiachuan Xu, Eric Huff, Pranjal R.S", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We present a new approach to measuring cosmic shear: the one-component Kinematic Lensing (KL) method. This technique provides a simplified implementation of KL that reduces shape noise in weak lensing (WL) by combining kinematic information with imaging data, while requiring less observational effort than the full two-component KL. We perform simulated likelihood analyses to assess the performance of the one-component KL and demonstrate its applicability to future radio surveys. Our forecasts indicate that, for radio surveys, the one-component KL is not yet competitive with traditional WL due to the shallow redshift distribution of HI-selected galaxies. However, when applying this method to deeper spectroscopic surveys with stronger emission lines, the one-component KL approach could surpass WL in constraining power, offering a promising and efficient pathway for future shear analyses."}
{"main_page": "https://arxiv.org/abs/2510.18027", "pdf": "https://arxiv.org/pdf/2510.18027", "title": "Title:\n          Discovery of Powerful Multi-Velocity Ultra-Fast Outflows in the Starburst Merger Galaxy IRAS 05189$-$2524 with XRISM", "authors": "Hirofumi Noda, Satoshi Yamada, Shoji Ogawa, Kouichi Hagino, Ehud Behar, Omer Reich, Anna Ogorzalek, Laura Brenneman, Yuichi Terashima, Misaki Mizumoto, Francesco Tombesi, Pierpaolo Condò, Alfredo Luminari, Atsushi Tanimoto, Megan E. Eckart, Erin Kara, Takashi Okajima, Yoshihiro Ueda, Yuki Aiso, Makoto Tashiro", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We observed the X-ray-bright ultra-luminous infrared galaxy, IRAS 05189$-$2524, with XRISM during its performance verification phase. The unprecedented energy resolution of the onboard X-ray microcalorimeter revealed complex spectral features at $\\sim$7$-$9 keV, which can be interpreted as blueshifted Fe XXV/XXVI absorption lines with various velocity dispersions, originating from ultra-fast outflow (UFO) components with multiple bulk velocities of $\\sim0.076c$, $\\sim0.101c$, and $\\sim0.143c$. In addition, a broad Fe-K emission line was detected around $\\sim7$ keV, forming a P Cygni profile together with the absorption lines. The onboard X-ray CCD camera revealed a 0.4$-$12 keV broadband spectrum characterized by a neutrally absorbed power-law continuum with a photon index of $\\sim2.3$, and intrinsic flare-like variability on timescales of $\\sim10$ ksec, both of which are likely associated with near-Eddington accretion. We also found potential variability of the UFO parameters on a timescale of $\\sim140$ ksec. Using these properties, we propose new constraints on the outflow structure and suggest the presence of multiple outflowing regions on scales of about tens to a hundred Schwarzschild radii, located within roughly two thousand Schwarzschild radii. Since both the estimated momentum and energy outflow rates of the UFOs exceed those of galactic molecular outflows, our results indicate that powerful, multi-velocity UFOs are already well developed during a short-lived evolutionary phase following a major galaxy merger, characterized by intense starburst activity and likely preceding the quasar phase. This system is expected to evolve into a quasar, sustaining strong UFO activity and suppressing star formation in the host galaxy."}
{"main_page": "https://arxiv.org/abs/2510.18044", "pdf": "https://arxiv.org/pdf/2510.18044", "title": "Title:\n          4 Second and 169 Second Rotation of Two Isolated, Ultramassive, Strongly Magnetic White Dwarfs", "authors": "Kurtis Williams, Zorayda Martinez, Melissa Ornelas", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Photometric variability in massive, magnetic white dwarfs (WDs) on the timescales of less than a few hours is oft interpreted as being due to magnetic spots on the surface of a rotating star. Increasingly, numbers of these short period variables are being discovered with the continued growth of time-domain astronomy, testing theories of magnetic white dwarf formation and angular momentum evolution. We present the detection of extremely rapid rotation in the WDs SDSS J1557+0411 and PG 1312+099, with periods of 168.94 s and 83.72 s, respectively. We consider other possible causes of the monoperiodic photometric variability, including binarity (eclipses and ellipsoidal variations) and asteroseismic pulsations. Though these cannot be ruled out with the existing data, these alternative explanations seem unlikely. SDSS J1557+0411 was predicted to be a rapidly rotating oxygen-neon core WD by Camisassa et al. (2022), a prediction borne out at least in part by our observations. PG 1312+099 was previously observed via polarimetry to be rotating with a period of ~5.4 h; we propose that this object may be an unresolved double degenerate system."}
{"main_page": "https://arxiv.org/abs/2510.18047", "pdf": "https://arxiv.org/pdf/2510.18047", "title": "Title:\n          Close-in faint companions mimicking interferometric hot exozodiacal dust observations", "authors": "Katsiaryna Tsishchankava, Florian Kirchschlager, Anton Krieger, Thomas A. Stuber, Sebastian Wolf", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Context: Interferometric observations of various nearby main-sequence stars show an unexpected infrared excess, raising the question of its origin. The two dominant interpretations favor hot exozodiacal dust or a faint companion, as both can produce similar signatures. Method: We modeled a system consisting of a star and a faint companion within a field of view of 2au x 2au. We calculated the visibility and closure phases for three VLTI instruments (PIONIER, GRAVITY, and MATISSE) and four telescope configurations. Aim: We aim to investigate the interferometric signatures of faint companions and assess their detectability. We explore limitations of current detection methods and evaluate the challenges in distinguishing between hot exozodiacal dust and a faint companion as the source of the observed excess. Results: We derived an upper limit for the companion-induced visibility deficit and closure phase. Contrary to the common interpretation that near-zero closure phases rule out the presence of a companion, we show that companions can remain undetected in closure phase data, as indicated by significant non-detection probabilities, yet, these companions can still produce measurable visibility deficits. We confirmed our results by reevaluating an L-band observation of kappa Tuc A. We found indications for a faint companion with a flux ratio of 0.7% and an estimated non-detection probability of around 21%, which could explain the variability of the previously observed visibility deficit. Conclusions: Previous companion rejection criteria, such as near-zero closure phases and flux estimates based on Gaussian-distributed dust densities, are not universally valid. This highlights the need for a reevaluation of companion rejections in former studies of the hot exozodiacal dust phenomenon. In addition, we propose a method for distinguishing both sources of visibility deficit."}
{"main_page": "https://arxiv.org/abs/2510.18065", "pdf": "https://arxiv.org/pdf/2510.18065", "title": "Title:\n          Can the CMB be Odd? Effect of a Parity-Violating Matter 4-Point Function on the Low-$\\ell$ CMB Trispectrum", "authors": "Zachary Slepian, Matthew Reinhard, Michael Bartlett", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Here we explore from a theoretical perspective the sensitivity of the primary CMB anisotropy trispectrum to parity violation (PV) in large-scale structure (LSS). We focus on the Sachs-Wolfe term, which dominates at $\\ell < 40$, after which the Doppler term takes over. We consider a model where the PV is only present out to some maximal scale $R$ of order a few hundred Mpc/$h$, consistent with what recent LSS 4PCF measurements seem to indicate. We find that the odd CMB trispectrum must be suppressed by at least one factor of $R/\\chi_*$$\\simeq$1\\%, with $\\chi_*$ the distance to last scattering, relative to the input matter 4PCF. Thus, a non-detection of PV in the CMB trispectrum is \\textit{not necessarily inconsistent} with a genuine detection of PV in the LSS 4PCF."}
{"main_page": "https://arxiv.org/abs/2510.18069", "pdf": "https://arxiv.org/pdf/2510.18069", "title": "Title:\n          Time-evolving diagnostic of the ionized absorbers in NGC 4051. I. High-resolution time-averaged spectroscopy", "authors": "Roberto Serafinelli, Fabrizio Nicastro, Alfredo Luminari, Yair Krongold, Francesco Camilloni, Elias Kammoun, Riccardo Middei, Enrico Piconcelli, Luigi Piro", "subjects": "Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We present a high-resolution X-ray spectroscopic study of the Narrow-Line Seyfert 1 galaxy NGC 4051 using two XMM-Newton high-resolution Reflection Grating Spectrometer (RGS) observations. The spectra reveal three distinct layers of photoionized gas flowing outward from the central black hole: a low-ionization phase (LIP), a higher-ionization phase (HIP), and a high-velocity and high ionization phase (HVIP). Each absorber leaves characteristic imprints on the soft X-ray spectrum. While the LIP and HVIP are fully consistent with being in ionization equilibrium with the central radiation field over the course of the $\\sim$250 ks spanned by the two observations, the HIP shows a significant change in ionization ($3.8\\sigma$), suggesting non-equilibrium. By modeling the two spectra with our time-dependent photoionization code (TEPID), we constrain the density of the HIP gas to $\\log n_{\\rm H}=7.7^{+0.2}_{-0.9}$ and estimate its distance to be about $R=0.45^{+0.80}_{-0.09}$ light-days from the black hole, corresponding to $R=4000^{+7000}_{-800}$ gravitational radii. In contrast, the narrow soft X-ray emission lines remain constant, consistent with an origin in the more extended narrow-line region. Our results show the value of combining high-resolution and time-resolved spectroscopy to probe the structure, physical conditions, and variability of AGN outflows."}
{"main_page": "https://arxiv.org/abs/2510.18090", "pdf": "https://arxiv.org/pdf/2510.18090", "title": "Title:\n          Clouds as the driver of variability and colour changes in brown dwarf atmospheres", "authors": "Lucas Teinturier, Benjamin Charnay, Aymeric Spiga, Bruno Bezard", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Brown dwarfs are massive, giant exoplanet analogues subject to variability and colour changes, known as the L/T transition, fundamental for their thermal evolution. The drivers of the L/T transition remain elusive, with atmospheric circulations and/or clouds usually suggested as potential mechanisms. Using a three-dimensional Global Climate Model including cloud formation, transport and multi-wavelength radiative effects, we show that clouds play a major role in shaping the atmospheric properties of brown dwarfs. Cloud radiative effect, which triggers atmospheric convection, leads to spectral, spatial, and temporal variability in the modelled brown dwarfs, in agreement with the observed variability and L/T transition. Low latitudes are subject to sustained wave activity, whereas eddies dominate higher latitudes. Our results highlight that the role of clouds as a driver of atmospheric dynamics and climate, well known for giant exoplanets, extends to all sub-stellar bodies."}
{"main_page": "https://arxiv.org/abs/2510.18098", "pdf": "https://arxiv.org/pdf/2510.18098", "title": "Title:\n          The Atmospheric Composition of Sub-Neptune K2-18 b and Implications for its Formation", "authors": "Gareb Fernández-Rodríguez, Giuseppe Morello, Jonathan C. Tan, Enric Pallé, Mark R. Swain, Efthymios Poultourtzidis, Alfredo Biagini, Quentin Changeat, Chengzi Jiang, Francisco J. Pozuelos, Pedro J. Amado", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Unlocking the atmospheres of sub-Neptunes is among JWST's major achievements, yet such observations demand complex analyses that strongly affect interpretations. We present an independent reanalysis of the original JWST transmission spectrum of K2-18 b, to assess the robustness of previously claimed detections, explore the parameter space, and implications for its formation. The observations were reduced using a combination of public and customized pipelines producing a total of 12 different versions of the transmission spectrum by varying: spectral binning, limb-darkening, and a novel correction for the occulted stellar spot. We then performed atmospheric retrievals using TauREx 3, comparing models of varying complexity, robustly detecting CH$_4$ (3-4$\\sigma$) across all configurations. The evidence for CO$_2$ is weaker and highly model-dependent. The tentative detection of dimethyl sulphide (DMS) vanishes in our most comprehensive retrieval models. We find that correcting the stellar spot in the NIRISS transit is a critical step, introducing a uniform offset that primarily drives the inference of a lower mean molecular weight atmosphere. Furthermore, the assumed complexity of the retrieval model itself introduces significant biases; including more molecules systematically increases the retrieved CH$_4$ abundance and atmospheric mean molecular weight, even for species without spectral features. The data are consistent with a hydrogen-rich atmosphere with an elevated O and an even more elevated C abundance, leading to a super-solar C/O. We show that the physical properties of the system planets K2-18 c, and K2-18 b are consistent with those expected by the in situ formation theory of Inside-Out Planet Formation (IOPF), interior to the carbon \"soot\" line, where an elevated C/O ratio of a primordial atmosphere is expected to be inherited from the protoplanetary disk."}
{"main_page": "https://arxiv.org/abs/2510.18110", "pdf": "https://arxiv.org/pdf/2510.18110", "title": "Title:\n          Extraplanar emission in isolated edge-on late-type galaxies.II. The H$α$ kinematics", "authors": "Minerva M. Sardaneta (1,2), Philippe Amram (3), Roberto Rampazzo (4), Margarita Rosado (1), Isaura Fuentes-Carrera (5), Soumavo Ghosh (6) ((1) Universidad Nacional Autonoma de Mexico. Instituto de Astronomia, Ciudad de Mexico, Mexico, (2) Departamento de Astronomía, Universidad de La Serena, La Serena, Chile, (3) Aix-Marseille Univ, CNRS, CNES, LAM, Marseille, France, (4) INAF-Osservatorio Astrofisico di Asiago, Asiago, Italy, (5) Escuela Superior de Fisica y Matematicas, Instituto Politecnico Nacional, U.P. Adolfo Lopez Mateos, Ciudad de Mexico, Mexico, (6) Department of Astronomy, Astrophysics and Space Engineering, Indian Institute of Technology Indore, India)", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Isolated galaxies are rare yet invaluable for studying secular evolution, as their physical properties can remain largely unaffected by external influences for several billion years, primarily shaped by internal evolutionary processes. This study focuses on a representative sample of nearly edge-on ($i\\geq80^{\\circ}$) late-type galaxies selected from the Catalogue of Isolated Galaxies (CIG). We analyse the H$\\alpha$ kinematics derived from Fabry-Perot data and integrate these findings with a comprehensive examination of the UV, optical, and FIR properties of these galaxies to study their dynamic evolutionary processes. We investigate the individual kinematics by computing rotation curves and dynamical masses for each galaxy in the sample. The accuracy of our kinematic results is confirmed through comparisons with HI data and by applying the B- and K-band Tully-Fisher relationships. Among the galaxies studied, we observed a rotational lag along the $z$-axis in half of the total sample (7 out of 14 cases), with an average lag ($\\Delta V/\\Delta z=32.0\\pm10.6\\,{\\rm km\\,s^{-1}\\,pc^{-1}}$) consistent with previous research findings. Notably, not all galaxies exhibiting measurable lag display morphological extraplanar components, leading us to conclude that this cannot serve as a definitive marker for the extraplanar Diffuse Ionized Gas (eDIG) component. While we found no significant correlations between rotation lag and overall galaxy properties, there seems to be a potential correlation with tidal strength. Based on the kinematic characteristics observed in our sample, we suggest that that the extended disc gas likely originates from interactions with the Circumgalactic Medium (CGM) rather than arising internally within the galaxies themselves."}
{"main_page": "https://arxiv.org/abs/2510.18119", "pdf": "https://arxiv.org/pdf/2510.18119", "title": "Title:\n          Constraints on the Correlation of IceCube Neutrinos with Tracers of Large-Scale Structure", "authors": "R. Abbasi, M. Ackermann, J. Adams, S. K. Agarwalla, J. A. Aguilar, M. Ahlers, J.M. Alameddine, S. Ali, N. M. Amin, K. Andeen, C. Argüelles, Y. Ashida, S. Athanasiadou, S. N. Axani, R. Babu, X. Bai, J. Baines-Holmes, A. Balagopal V., S. W. Barwick, S. Bash, V. Basu, R. Bay, J. J. Beatty, J. Becker Tjus, P. Behrens, J. Beise, C. Bellenghi, B. Benkel, S. BenZvi, D. Berley, E. Bernardini, D. Z. Besson, E. Blaufuss, L. Bloom, S. Blot, I. Bodo, F. Bontempo, J. Y. Book Motzkin, C. Boscolo Meneguolo, S. Böser, O. Botner, J. Böttcher, J. Braun, B. Brinson, Z. Brisson-Tsavoussis, R. T. Burley, D. Butterfield, M. A. Campana, K. Carloni, J. Carpio, S. Chattopadhyay, N. Chau, Z. Chen, D. Chirkin, S. Choi, B. A. Clark, A. Coleman, P. Coleman, G. H. Collin, D. A. Coloma Borja, A. Connolly, J. M. Conrad, D. F. Cowen, C. De Clercq, J. J. DeLaunay, D. Delgado, T. Delmeulle, S. Deng, P. Desiati, K. D. de Vries, G. de Wasseige, T. DeYoung, J. C. Díaz-Vélez, S. DiKerby, T. Ding, M. Dittmer, A. Domi, L. Draper, L. Dueser, D. Durnford, K. Dutta, M. A. DuVernois, T. Ehrhardt, L. Eidenschink, A. Eimer, P. Eller, E. Ellinger, D. Elsässer, R. Engel, H. Erpenbeck, W. Esmail, S. Eulig, J. Evans, P. A. Evenson, K. L. Fan, K. Fang, K. Farrag, A. R. Fazely, A. Fedynitch, N. Feigl", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "The IceCube Neutrino Observatory has observed extragalactic astrophysical neutrinos with an apparently isotropic distribution. Only a small fraction of the observed astrophysical neutrinos can be explained by known sources. Neutrino production is thought to occur in energetic environments that are ultimately powered by the gravitational collapse of dense regions of the large-scale mass distribution in the universe. Whatever their identity, neutrino sources likely trace this large-scale mass distribution. The clustering of neutrinos with a tracer of the large-scale structure may provide insight into the distribution of neutrino sources with respect to redshift and the identity of neutrino sources. We implement a two-point angular cross-correlation of the Northern sky track events with an infrared galaxy catalog derived from WISE and 2MASS source catalogs that trace the nearby large-scale structure. No statistically significant correlation is found between the neutrinos and this infrared galaxy catalog. We find that < ~54% of the diffuse muon neutrino flux can be attributed to sources correlated with the galaxy catalog with 90% confidence. Additionally, when assuming that the neutrino source comoving density evolves following a power-law in redshift, $dN_s/dV \\propto (1+z)^{k}$, we find that sources with negative evolution, in particular k < -1.75, are disfavored at the 90% confidence level"}
{"main_page": "https://arxiv.org/abs/2510.18124", "pdf": "https://arxiv.org/pdf/2510.18124", "title": "Title:\n          The s process in massive stars, a benchmark for neutron capture reaction rates", "authors": "Marco Pignatari, Roberto Gallino, Rene Reifarth", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "A clear definition of the contribution from the slow neutron-capture process (s process) to the solar abundances between Fe and the Sr-Zr region is a crucial challenge for nuclear astrophysics. Robust s-process predictions are necessary to disentangle the contribution from other stellar processes producing elements in the same mass region. Nuclear uncertainties are affecting s-process calculations, but most of the needed nuclear input are accessible to present nuclear experiments or they will be in the near future. Neutron-capture rates have a great impact on the s process in massive stars, which is a fundamental source for the solar abundances of the lighter s-process elements heavier than Fe (weak s-process component). In this work we present a new nuclear sensitivity study to explore the impact on the s process in massive stars of 86 neutron-capture rates, including all the reactions between C and Si and between Fe and Zr. We derive the impact of the rates at the end of the He-burning core and at the end of the C-burning shell, where the $^{22}$Ne($\\alpha$,n)$^{25}$Mg reaction is is the main neutron source. We confirm the relevance of the light isotopes capturing neutrons in competition with the Fe seeds as a crucial feature of the s process in massive stars. For heavy isotopes we study the propagation of the neutron-capture uncertainties, finding a clear difference of the impact of Fe and Co isotope rates with respect to the rates of heavier stable isotopes. The local uncertainty propagation due to the neutron-capture rates at the s-process branching points is also considered, discussing the example of $^{85}$Kr. The complete results of our study for all the 86 neutron-capture rates are available online. Finally, we present the impact on the weak s process of the neutron-capture rates included in the new ASTRAL library (v0.2)."}
{"main_page": "https://arxiv.org/abs/2510.18136", "pdf": "https://arxiv.org/pdf/2510.18136", "title": "Title:\n          Deep Synoptic Array Science: Searching for Long Duration Radio Transients with the DSA-110", "authors": "Myles B. Sherman, Nikita Kosogorov, Casey Law, Vikram Ravi, Jakob T. Faber, Stella K. Ocker, Liam Connor, Yuanhong Qu, Kaitlyn Shin, Kritti Sharma, Pranav Sanghavi, Gregg Hallinan, Mark Hodges", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "We describe the design and commissioning tests for the DSA-110 Not-So-Fast Radio Burst (NSFRB) search pipeline, a 1.4 GHz image-plane single-pulse search sensitive to 134 ms-160.8 s radio bursts. Extending the pulse width range of the Fast Radio Burst (FRB) search by 3 orders of magnitude, the NSFRB search is sensitive to the recently-discovered Galactic Long Period Radio Transients (LPRTs). The NSFRB search operates in real-time, utilizing a custom GPU-accelerated search code, \\texttt{cerberus}, implemented in Python with JAX. We summarize successful commissioning sensitivity tests with continuum sources and pulsar B0329+54, estimating the $6\\sigma$ flux (fluence) threshold to be ~290 mJy (~40 Jy ms). Future tests of recovery of longer timescale transients, e.g. CHIME J1634+44, are planned to supplement injection testing and B0329+54 observations. An offline DSA-110 NSFRB Galactic Plane Survey was conducted to search for LPRTs, covering $-3.5^\\circ<b<5.7^\\circ$ and $141^\\circ<l<225^\\circ$ (~770 square degrees) in Galactic coordinates. We estimate an upper limit Poissonian burst rate ~1 hr$^{-1}$ per square degree (~7 hr$^{-1}$ per $3^\\circ\\times3^\\circ$ survey grid cell) maximized across the inner $|b|<0.25^\\circ$ of the surveyed region. By imposing the ~290 mJy flux limit on two representative models (the magnetar plastic flow model and the White Dwarf-M Dwarf binary model), we reject with 95% confidence the presence of White Dwarf-M Dwarf binary LPRTs with periods between ~10-70s within ~95% of the surveyed region. Combined with the prevalence of LPRTs in the Galactic Plane, our results motivate further consideration of both White Dwarf-M Dwarf binary models and isolated magnetar models. We will continue to explore novel LPRT search strategies during real-time operations, such as triggered periodicity searches and additional targeted surveys."}
{"main_page": "https://arxiv.org/abs/2510.18139", "pdf": "https://arxiv.org/pdf/2510.18139", "title": "Title:\n          The Photometric Analysis of the Environment Around Two Dusty Star-Forming Galaxies at $z \\sim 2$", "authors": "Joe Bhangal, Allison W. S. Man, Tom J. L. C. Bakx, Darko Donevski, Pierre Cox, Helmut Dannerbauer, Stephen Serjeant, Masato Hagimoto, Pluto Jiang, Wenxiao Liu", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Studying the environments of dusty star-forming galaxies (DSFGs) provides insight into whether these luminous systems are reliable signposts of large-scale overdensities. Evidence suggests that individual DSFGs can trace overdense environments, although this association may not be universal. To test this, we investigate the environments surrounding two luminous, gravitationally-lensed DSFGs (SDP.17b at $z_\\text{spec} = 2.3049$ and HELMS-55 at $z_\\text{spec} = 2.2834$). Using Gemini South Flamingos-2 (F2) $K_s$-band imaging together with ancillary Subaru Hyper Suprime-Cam and Hubble Space Telescope multi-band photometry, we obtain photometric redshifts, $z_\\text{phot}$, as well as star formation rates and stellar mass estimates for companion galaxies of the DSFGs. At least $5\\pm2$ and $15\\pm3$ companion galaxies exist with consistent $z_\\text{phot}$ ($dz \\leq 0.2$) within a projected separation of 5.5 cMpc of SDP.17b and HELMS-55, respectively. These correspond to galaxy overdensities of $\\delta = 0.1 \\pm 0.2$ and ${\\delta} =1.0 \\pm 0.3$, with significances of $(0.2 \\pm 0.4)\\sigma$ and $(2.2 \\pm 0.6) \\sigma$, respectively. On the $M_{\\rm H_2}$-overdensity-significance plane, HELMS-55 may follow the positive correlation between the gas mass and the overdensity significance, while SDP.17b lies well above the relation despite its large gas reservoir, making it a potential outlier. Based on this study of two DSFGs, our photometric analysis suggests that DSFGs can trace the outskirts of protoclusters or associated large-scale structures. However, our small sample prevents firm conclusions about their ability to pinpoint dense cluster cores. Future multi-object spectroscopic observations are required to confirm the membership and star formation properties of the companion galaxies."}
{"main_page": "https://arxiv.org/abs/2510.18153", "pdf": "https://arxiv.org/pdf/2510.18153", "title": "Title:\n          The thermal and kinematic Sunyaev-Zeldovich effect in galaxy clusters and filaments using multifrequency temperature maps of the cosmic microwave background: Abell 399--Abell 401 cluster pair case study", "authors": "Ajay S. Gill, Yilun Guan, Adam D. Hincks, Tony Mroczkowski, Zachary Atkins, Eleonora Barbavara, Elia S. Battistelli, J. Richard Bond, William Coulton, Adri J. Duivenvoorden, Matt Hilton, John P. Hughes, Giovanni Isopi, Joshiwa van Marrewijk, Kavilan Moodley, Sigurd Naess, Bruce Partridge, Bernardita Ried Guachalla, John Orlowski-Scherer, Cristóbal Sifón, Eve M. Vavagiakis, Edward J. Wollack", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "We present a multifrequency and multi-instrument methodology to study the physical properties of galaxy clusters and cosmic filaments using cosmic microwave background observations. Our approach enables simultaneous measurement of both the thermal (tSZ) and kinematic Sunyaev-Zeldovich (kSZ) effects, incorporates relativistic corrections, and models astrophysical foregrounds such as thermal dust emission. We do this by jointly fitting a single physical model across multiple maps from multiple instruments at different frequencies, rather than fitting a model to a single Compton-$y$ map. We demonstrate the success of this method by fitting the Abell 399-Abell 401 galaxy cluster pair and filament system using archival data from the Planck satellite and new, targeted deep data from the Atacama Cosmology Telescope, covering 11 different frequencies over 14 maps from 30 GHz to 545 GHz. Our tSZ results are consistent with previous work using Compton-$y$ maps. We measure the line-of-sight peculiar velocities of the cluster-filament system using the kSZ effect and find statistical uncertainties on individual cluster peculiar velocities of $\\lesssim $600 km s$^{-1}$, which are competitive with current state-of-the-art measurements. Additionally, we measure the optical depth of the filament component with a signal-to-noise of 8.5$\\sigma$ and reveal hints of its morphology. This modular approach is well-suited for application to future instruments across a wide range of millimeter and sub-millimeter wavebands."}
{"main_page": "https://arxiv.org/abs/2510.18156", "pdf": "https://arxiv.org/pdf/2510.18156", "title": "Title:\n          Disentangling Thermal and Abundance Characteristics in a Solar Flare Using SDO/AIA, Hinode/XRT, and MinXSS-1 Observations", "authors": "Xiaoyan Xie, Anna Chen, Crisel Suarez, Katharine K. Reeves, Soumya Roy, Christopher S. Moore, Nishu Karna, Joy Velasquez", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "We investigate the thermal properties of a solar flare by the observations of soft X-ray Telescope (XRT) on board Hinode and the Atmospheric Image Assembly on board the Solar Dynamics Observatory (SDO/AIA). Our analysis reveals a tenuous but hot plasma cloud located above the flare loops. The flare loops and plasma cloud exhibit independent temperature profiles as a function of time, implying different heating mechanisms are present in these structures. We interpret the plasma cloud as an eruptive filament directly heated in the corona via magnetic reconnection that occurs when a rising filament interacts with this eruptive filament. Previous disk-integrated solar soft X-ray spectral measurements of this flare using the Miniature X-ray Solar Spectrometer CubeSat-1 (MinXSS-1) inferred coronal abundances at the flare peak. However, MinXSS synthetic spectra from AIA observations show that the plasma cloud is too tenuous to be detected in MinXSS-1 and thus the coronal abundances of low FIP elements must be in emission from the flare loops. Furthermore, we demonstrate the non-negligible differences in differential emission measures (DEMs) between coronal and photospheric abundance models. These results highlight the importance of instruments capable of simultaneous spectral and spatial diagnostics during large-scale solar events. Such coordinated measurements would enable more accurate thermal and compositional analyses and deeper insight into the underlying physical mechanisms."}
{"main_page": "https://arxiv.org/abs/2510.18157", "pdf": "https://arxiv.org/pdf/2510.18157", "title": "Title:\n          A Physical Model for the Ice Coma of 3I/ATLAS", "authors": "Eric Keto, Abraham Loeb", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "High-resolution imaging of interstellar comet 3I/ATLAS with the Hubble Space Telescope on July 21, 2025 revealed a pronounced sunward anti-tail with a projected 2:1 elongation that our earlier study suggests is dominated by scattering off grains of H$_2$O ice ejected from the nucleus by CO$_2$ sublimation. Subsequent observations with the Keck and Gemini South observatories showed a reduction in the anti-tail and the growth of a conventional tail in a direction away from the sun. In this study we explain the physics behind this evolution. As a function of heliocentric distance, we model the apparent visual brightness of scattering in the ice coma. As the comet approaches the Sun, the exponential temperature dependence of the sublimation rate causes a continuous increase in the production rate of ice grains and a sharp decline in their residence time within the observing aperture. The combined effects produce a peak in total scattering cross-section due to H$_2$O ice grains at 3-4 AU. At closer distances, the scattering becomes dominated by longer-lived refractory and larger volatile grains with survival times long enough to form a conventional tail."}
{"main_page": "https://arxiv.org/abs/2510.18182", "pdf": "https://arxiv.org/pdf/2510.18182", "title": "Title:\n          Electron Acceleration via Lower-Hybrid Drift Instability in Astrophysical Plasmas: Dependence on Plasma Beta and Suprathermal Electron Distributions", "authors": "Ji-Hoon Ha, Elena S. Volnova", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph)", "abstract": "Density inhomogeneities are ubiquitous in space and astrophysical plasmas, particularly at magnetic reconnection sites, shock fronts, and within compressible turbulence. The gradients associated with these inhomogeneous plasma regions serve as free energy sources that can drive plasma instabilities, including the lower-hybrid drift instability (LHDI). Notably, lower-hybrid waves are frequently observed in magnetized space plasma environments, such as Earth's magnetotail and magnetopause. Previous studies have primarily focused on modeling particle acceleration via LHDI in these regions using a quasilinear approach. This study expands the investigation of LHDI to a broader range of environments, spanning weakly to strongly magnetized media, including interplanetary, interstellar, intergalactic, and intracluster plasmas. To explore the applicability of LHDI in various astrophysical settings, we employ two key parameters: (1) plasma magnetization, characterized by the plasma beta parameter, and (2) the spectral slope of suprathermal electrons following a power-law distribution. Using a quasilinear model, we determine the critical values of plasma beta and spectral slope that enable efficient electron acceleration via LHDI by comparing the rate of growth of instability and the damping rate of the resulting fluctuations. We further analyze the time evolution of the electron distribution function to confirm these critical conditions. Our results indicate that electron acceleration is generally most efficient in low-beta plasmas ($\\beta < 1$). However, the presence of suprathermal electrons significantly enhances electron acceleration via LHDI, even in high-beta plasmas ($\\beta > 1$). Finally, we discuss the astrophysical implications of our findings, highlighting the role of LHDI in electron acceleration across diverse plasma environments."}
{"main_page": "https://arxiv.org/abs/2510.18200", "pdf": "https://arxiv.org/pdf/2510.18200", "title": "Title:\n          Spectroscopic study of the light-polluted night sky in Hong Kong", "authors": "Chu Wing So, Chun Shing Jason Pun, Shengjie Liu", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Spectroscopic study of the night sky has been a common way to assess the impacts of artificial light at night at remote astronomical observatories. However, the spectroscopic properties of the urban night sky remain poorly documented. We addressed this gap by collecting more than 12,000 zenith sky spectra with compact spectrometers at urban and suburban sites from 2021 to 2023. Here, by examining the intensity variations of the spectral features that represent characteristic emissions from common artificial light sources, we show that the skyglow is predominantly shaped by artificial emissions, including compact fluorescent lamps and high-pressure sodium lamps. Contributions from commercially controlled lighting, including those for floodlighting and advertising adopting light-emitting diode and metal halide technologies, were more pronounced in urban areas during the hours leading up to midnight. We also documented direct evidence of the impact of a neon sign located on top of a commercial tower, illustrating how a single light source can significantly influence the surrounding environment. Compared with observations made a decade ago at the same location, our findings indicate a growing popularity of light-emitting diode lighting for external use, consistent with the existing literature. This first comprehensive spectroscopic investigation of light pollution in an urban environment emphasizes the evolving patterns of outdoor lighting and highlights the critical and unique role of spectroscopic measurements. The results provide essential information for the development of effective strategies and policies to mitigate light pollution in urban areas and at sites of astronomical importance."}
{"main_page": "https://arxiv.org/abs/2510.18207", "pdf": "https://arxiv.org/pdf/2510.18207", "title": "Title:\n          The Origin of Self-similar FRED Profiles in Gamma-Ray Bursts Pulses", "authors": "Shu-Xu Yi, Chen-Wei Wang, Shao-Lin Xiong, Shuang-Nan Zhang, Romain Maccary, Rahim Moradi, Shuo Xiao, Hua Feng", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "To understand the physical mechanisms underlying the prompt emission of gamma-ray bursts (GRB), single FRED (Fast-Rise-Exponential-Decay) profile GRBs serve as an ideal sample, as they origin from single epoch central engine activity. These GRBs have been found to exhibit a peculiar morphology-including the elegant self-similarity across energy bands and the recently discovered composite nature challenging nearly all existing radiation mechanisms, sparking widespread curiosity about their origins. Here we propose a physical model which includes radiation locations sequentially triggered by propagating magnetic perturbations. It naturally explains all observed properties of these GRBs, including the self-similar FRED profile, multi-band aligned subpulses, hard-to-soft spectral evolution, local intensity tracking, and increasing subpulse durations. Furthermore, our results demonstrate that the duration of these GRBs is not reflecting the activity timescale of the central engine, reconciling recent challenges to the traditional merger-short/collapsar-long dichotomy of GRBs."}
{"main_page": "https://arxiv.org/abs/2510.18227", "pdf": "https://arxiv.org/pdf/2510.18227", "title": "Title:\n          Milky Way Mass Through Escape Velocity Curve from LAMOST K Giants", "authors": "Yin Wu, Haining Li, Yang Huang, Xiang-Xiang Xue, Gang Zhao", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Escape velocity has long been used to constrain the mass of the Dark Matter (DM) halo in the Milky Way (MW). Here we present a study of the escape velocity curve using a sample of high-velocity K giants with full 6D phase-space information and relatively good quality, selected from LAMOST DR8 and cross-matched with Gaia DR3. To expand the high-velocity stars to larger distances, we used radius-dependent criteria of total velocity, that is, $v_{\\rm GC}>300\\;\\rm{km s^{-1}}$ for the solar neighborhood; $v_{\\rm GC}>v_{\\rm min}\\sim0.6\\times v_{\\rm esc}(r_{\\rm GC})$ for outer region. We also selected halo stars based on $v_{\\phi}-{\\rm [Fe/H]}$ information to ensure that the sample is isotropic. We modeled the velocity distribution with traditional power-law models to determine the escape velocity in each radial bin. For the first time, we have directly measured a relatively continuous escape velocity curve that can extend to Galactocentric radii of $\\sim 50$ kpc, finding a decline in agreement with previous studies. The escape velocity at the solar position yielded by our measurements is $523.74^{+12.83}_{-13.47}\\;\\rm{km s^{-1}}$. Combined with the local circular velocity, we estimated the mass of the MW assuming a Navarro-Frenk-White DM profile, which resulted in a total mass of $M_{200,\\;\\rm{total}}=0.90_{-0.07}^{+0.06}\\times 10^{12}\\;M_{\\odot}$, with a concentration of $c_{200}=13.47_{-1.70}^{+1.85}$. The small uncertainty implies that including the escape velocities beyond the solar neighborhood can result in a more precise mass estimate. Our derived MW mass is consistent with some recent studies using the escape velocity as well as other tracers, which may support a lower mass of the DM halo than in the past."}
{"main_page": "https://arxiv.org/abs/2510.18231", "pdf": "https://arxiv.org/pdf/2510.18231", "title": "Title:\n          SKYSURF-11: A New Zodiacal Light Model Optimized for Optical Wavelengths", "authors": "Rosalia O'Brien, Richard G. Arendt, Rogier A. Windhorst, Tejovrash Acharya, Annalisa Calamida, Timothy Carleton, Delondrae Carter, Seth H. Cohen, Eli Dwek, Brenda L. Frye, Rolf A. Jansen, Scott J. Kenyon, Anton M. Koekemoer, John MacKenty, Megan Miller, Rafael Ortiz III, Peter C. B. Smith, Scott A. Tompkins", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We present an improved zodiacal light model, optimized for optical wavelengths, using archival Hubble Space Telescope (HST) imaging from the SKYSURF program. The Kelsall et. al. 1998 model used infrared imaging from the Diffuse Infrared Background Experiment (DIRBE) on board the Cosmic Background Explorer to create a 3D structure of the interplanetary dust cloud. However, this model cannot accurately represent zodiacal light emission outside of DIRBE's nominal wavelength bandpasses, the bluest of which is 1.25 micron. We present a revision to this model (called ZodiSURF) that incorporates analytical forms of both the scattering phase function and albedo as a function of wavelength, which are empirically determined across optical wavelengths (0.3-1.6 micron) from over 5,000 HST sky surface brightness (sky-SB) measurements. This refined model results in significantly improved predictions of zodiacal light emission at these wavelengths and for Sun angles greater than 80 deg. Fits to HST data show an uncertainty in the model of ~4.5%. Remarkably, the HST sky-SB measurements show an excess of residual diffuse light (HST Sky - ZodiSURF - Diffuse Galactic Light) of 0.013 +/- 0.006 MJy/sr. The blue color of our diffuse light signal makes it unlikely to be of extragalactic origin. Instead, we suggest that a very dim spherical dust cloud may need to be included in the zodiacal light model, which we present here as a toy model."}
{"main_page": "https://arxiv.org/abs/2510.18248", "pdf": "https://arxiv.org/pdf/2510.18248", "title": "Title:\n          The ALPINE-CRISTAL-JWST Survey: Stellar and nebular dust attenuation of main-sequence galaxies at z~4-6", "authors": "Akiyoshi Tsujita, Seiji Fujimoto, Andreas Faisst, Meédéric Boquien, Juno Li, Andrea Ferrara, Andrew J. Battisti, Poulomi Dam, Manuel Aravena, Matthieu Béthermin, Caitlin M. Casey, Olivia R. Cooper, Steven L. Finkelstein, Michele Ginolfi, Diego A. Gómez-Espinoza, Ali Hadi, Rodrigo Herrera-Camus, Edo Ibar, Hanae Inami, Gareth C. Jones, Anton M. Koekemoer, Kotaro Kohno, Brian C. Lemaux, Ilse De Looze, Ikki Mitsuhashi, Juan Molina, Ambra Nanni, Francesca Pozzi, Naveen A. Reddy, Monica Relano, Giulia Rodighiero, Michael Romano, David B. Sanders, Prasad Sawant, Manuel Solimano, Laura Sommovigo, Justin Spilker, Ken-ichi Tadaki, Livia Vallini, Vicente Villanueva, Wuji Wang, Giovanni Zamorani", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Characterizing dust attenuation is crucial for revealing the intrinsic physical properties of galaxies. We present an analysis of dust attenuation in 18 spectroscopically confirmed star-forming main-sequence galaxies at $z = 4.4-5.7$ observed with JWST/NIRSpec IFU and NIRCam, selected from the ALPINE and CRISTAL ALMA large programs. We fit the emission line fluxes from NIRSpec and the broad-band photometry from NIRCam with Prospector, using both spatially integrated emission and $\\sim0.6$ kpc pixel-by-pixel measurements. We derive the stellar-to-nebular dust attenuation ratio ($f=E(B-V)_{\\mathrm{star}}/E(B-V)_{\\mathrm{neb}}$) from the SED fits and the Balmer decrement with H$\\alpha$ and H$\\beta$. Although individual galaxies show large scatter, the best-fit value is $f = 0.51^{+0.04}_{-0.03}$, slightly higher than that measured for local starburst galaxies. We find weak correlations of $f$ with galaxy properties, increasing with higher specific star-formation rates, younger stellar ages, and more recent star-formation. For the range of $E(B-V)_{\\mathrm{star}} = 0.009-0.15$ mag for in our sample, assuming $f = 1$ (often adopted in high-redshift studies) instead of $f = 0.51$ underestimate line luminosities and ionizing photon production efficiency $\\xi_\\text{ion}$ by $\\sim3-36\\%$ and $\\sim4-46\\%$, respectively. We also find that the total stellar masses estimated from spatially-integrated SED fits with a delayed-$\\tau$ star-formation histories are systematically smaller than the sum of pixel-by-pixel SED fits, with a median offset of $\\sim 0.26$ dex, likely because the integrated fits are biased toward luminous young stellar populations."}
{"main_page": "https://arxiv.org/abs/2510.18293", "pdf": "https://arxiv.org/pdf/2510.18293", "title": "Title:\n          On the consistency of jet feedback modelling across different astrophysics hydrodynamical codes", "authors": "N. Maragkakis, M. A. Bourne, C. Power, F. Huško, A. Ludlow, S. Shabala", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Active Galactic Nuclei (AGN) feedback is essential in cosmological simulations of galaxy formation, yet its implementation has to rely on subgrid models due to limited resolution. We present a novel subgrid jet-launching method for galaxy formation simulations and implement it in three hydrodynamical codes: the smoothed particle hydrodynamics (SPH) code SWIFT, the moving-mesh code AREPO, and the Eulerian grid code PLUTO. To isolate the impact of hydrodynamical solvers on jet evolution, we compare idealised jets and their remnants in uniform and stratified media across resolutions and jet parameters. In uniform media, all jets drive bow shocks, inflate hot lobes, exhibit backflows, and evolve self-similarly. For the parameters explored, SWIFT lobes are shorter, wider, and hotter; AREPO lobes are longer, thinner, and cooler; while PLUTO lobes display complex flows with intermediate characteristics. In stratified media, jets deviate from self-similar evolution, inflating longer and thinner lobes due to lower external ram pressure. After switch-off, SWIFT jets evolve into smooth cylindrical bubbles, AREPO jets produce long filamentary remnants, and PLUTO jets yield intermediate-length remnants with varying degrees of mixing. Despite such differences, all jets and remnants have a similar impact on the ambient medium. We conclude that variations in lobe properties between codes emerge even for identical subgrid prescriptions, since the coupling of jet feedback to resolvable scales and the effective resolution depend on the hydrodynamical method. In structure formation simulations, these solver differences are likely subdominant to uncertainties in subgrid modelling and calibration, while averaging over galaxy populations may lessen their impact."}
{"main_page": "https://arxiv.org/abs/2510.18294", "pdf": "https://arxiv.org/pdf/2510.18294", "title": "Title:\n          Sympathetic Eruption of Two Filaments and Associated Solar Coronal Jet", "authors": "Jiayan Yang, Leping Li, Huadong Chen, Yi Bi, Bo Yang, Junchao Hong, Yan Dong", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Combining the high-quality observations from the {\\it Solar Dynamics Observatory} (SDO), the Global Oscillation Network Group (GONG), and the Chinese H$\\alpha$ Solar Explorer (CHASE), we report a solar coronal jet triggered by the sympathetic eruption of two filaments on 2024 January 11. Initially, the western segment of an active region filament erupted. The erupting plasma propagated eastward, approximately along the filament's axis. This eruption perturbed the magnetic field of a second filament situated near its eastern footpoint, the second filament then erupted sympathetically about one hour later. The eruption of the second filament is a failed one, with the majority of the filament material falling back after the initial lifting. Although no GOES flare accompanied these filament eruptions, distinct brightenings were observed following each eruption. The second eruption produced a large coronal jet, which propagated along a bent trajectory with an apparent deflection angle of approximately 90 degrees. No clear evidence of magnetic reconnection was detected at the deflection site, thus we suspect that the jet may have traveled along an S-shaped trans-equatorial loop and shown a curved trajectory. This event exhibits multiple phenomena: partial filament eruption, failed filament eruption, sympathetic filament eruption, jet initiation by filament eruption, and apparently deflected jet propagation. Collectively, these observations highlight the complexity and diversity of solar activity."}
{"main_page": "https://arxiv.org/abs/2510.18301", "pdf": "https://arxiv.org/pdf/2510.18301", "title": "Title:\n          The Growth of the Central Black Holes in Quasi-stars", "authors": "Jake Hassan, Rosalba Perna, Matteo Cantiello, Philip Armitage, Mitchell Begelman, Taeho Ryu", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Observations by JWST have confirmed the presence of supermassive black holes (BHs) at redshifts $z\\gtrsim10$, lending support to scenarios in which BHs experience rapid growth through intense gas accretion. Here we investigate the growth of a BH embedded at the center of a quasi-star, a theoretically predicted object formed via direct collapse. In a quasi-star, the central BH accretes at a highly super-Eddington rate, while the excess energy is transported outward by convection and radiated at approximately the Eddington luminosity of the entire star. We employ the open-source stellar evolution code \\texttt{MESA} to construct quasi-star models and follow the time-dependent growth of the central BH under different prescriptions for the accretion rate at the inner boundary $R_i$, and further considering the effect of winds. For the case $R_i=NR_{\\rm B}$, where $N$ is a constant and $R_{\\rm B}$ is the Bondi radius corresponding to the mass of the BH and the gas infalling onto it, our models terminate when the BH mass reaches a critical value $M_{\\mathrm{crit}}(N)=c_{s,i}^3/(12\\sqrt{N^3G^3\\pi\\rho_i})$ (where $c_{s,i}$ and $\\rho_i$ are the sound speed and density at $R_i$, respectively), a limit we also derive analytically. Models that feature an inner convective region matched to an outer adiabatic envelope exhibit BH growth up to approximately $M_{\\mathrm{BH}}/M_\\star\\simeq 0.33$, largely independent of the stellar mass $M_\\star$ itself. This ratio is approximately preserved even in the presence of mass loss, as several properties of the model are independent of the quasi-star's total mass."}
{"main_page": "https://arxiv.org/abs/2510.18305", "pdf": "https://arxiv.org/pdf/2510.18305", "title": "Title:\n          Variance of dust temperature and spectral index in Planck polarization data using spin-moment expansion", "authors": "Vincent Guillet, Léo Vacher, Jonathan Aumont, François Boulanger, Alessia Ritacco, Jean-Marc Delouis, Andrea Bracco", "subjects": "Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Thermal dust is the major polarized foreground hindering the detection of primordial CMB B-modes. Its signal presents a complex behavior in frequency space inherited from the joint variation in our Galaxy of the orientation of magnetic fields and of the spectral properties of dust grains aligned with magnetic field lines. In this work, we present a new framework for analyzing the thermal dust signal using polarized microwave data. We introduce residual maps, represented as complex quantities, that capture deviations of the local polarized SED from the mean complex SED averaged over the sky mask. We make simple predictions that relate the values of the statistical correlation and covariances between the residual maps to the physical properties of the emitting aligned grains. The validation or falsification of these predictions provide valuable information on the nature of the dust signal. We confront our predictions with Planck data over a 97% mask excluding the inner Galactic plane. Despite its simplicity, our model captures a significant part of the statistical properties of the data. The spectral dependence of the covariances between residual maps is, for the Sroll2 version of the data, compatible with a dust model assuming only temperature variations rather than spectral index variations, while it is incompatible with either of them for the PR4 Planck official release. Our methodology can be used to analyze future high precision polarization data and build more accurate dust models to be used by the CMB community."}
{"main_page": "https://arxiv.org/abs/2510.18312", "pdf": "https://arxiv.org/pdf/2510.18312", "title": "Title:\n          The $\\mathtt{WebSky}$ $\\mathrm{[CII]}$ Forecasts and the search for primordial intermittent non-Gaussianity", "authors": "Nathan J. Carlson, J. Richard Bond, Dongwoo T. Chung, Patrick Horlaville, Thomas Morrison", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We present the $\\mathtt{WebSky}$ $\\mathrm{[CII]}$ line-intensity mock maps and forecast the capabilities of upcoming wide-field submillimeter-wave surveys of cosmological $\\mathrm{[CII]}$ emission from the epoch of reionization (EoR). Using the $\\mathtt{Peak~Patch}$ algorithm to generate light-cone dark matter (DM) halo catalogues and the $\\mathtt{WebSky}$ framework to forward-model the cosmological $\\mathrm{[CII]}$ signal, we construct tomographic mock surveys matched to the CCAT Observatory. We investigate both astrophysical models of $\\mathrm{[CII]}$ emission from interstellar gas and the potential for the study of primordial intermittent non-Gaussianity (PING) as a science case for Stage 2 line intensity mapping (LIM) surveys. The $\\mathrm{[CII]}$ voxel intensity distribution (VID) is used as a summary statistic in forecasts. Additional constraints on PING are derived from a relative entropy study of $\\mathtt{Peak~Patch}$ halo mass functions. We show that upcoming LIM surveys will provide insights into the way we model cosmological line emission, and next-generation surveys can place competitive bounds on novel inflationary scenarios such as PING. The $\\mathtt{WebSky}$ $\\mathrm{[CII]}$ mocks and corresponding $\\mathtt{Peak~Patch}$ halo catalogues are publicly available at this https URL ."}
{"main_page": "https://arxiv.org/abs/2510.18317", "pdf": "https://arxiv.org/pdf/2510.18317", "title": "Title:\n          Comparative Statistical Analysis of Prompt and Afterglow X-Ray Flares in Gamma-Ray Bursts: Insights into Extended Central Engine Activity", "authors": "Yinuo Ma, He Gao", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Gamma-ray bursts (GRBs) are the most energetic phenomena in the Universe, characterized by prompt gamma-ray emission followed by multiwavelength afterglows. X-ray flares, observed during the afterglow phase, are generally believed to originate from the prolonged activity of the central engine, though direct evidence has been scarce. In this study, we present a comprehensive statistical analysis of X-ray flares from 315 GRBs observed by the Swift/X-ray Telescope over nearly two decades. We categorize flares into prompt flares (occurring during the prompt emission phase) and afterglow flares and compare their temporal and luminosity properties. Our analysis reveals that both types of flares exhibit similar morphological characteristics, with prompt flares being brighter and occurring earlier than afterglow flares. We find strong correlations between flare parameters, such as peak time, duration, and luminosity, which follow consistent patterns across both flare types. These findings suggest that X-ray flares, regardless of their timing, share a common origin in the central engine's activity. Our results imply that the central engine's activity duration extends beyond the prompt gamma-ray emission phase, highlighting the importance of considering X-ray flares when studying GRB progenitors and central engine properties. This work provides robust statistical evidence supporting the central engine origin of X-ray flares and underscores the need for future observations with missions like the Space-based multi-band astronomical Variable Objects Monitor and Einstein Probe to further elucidate the nature of GRB central engines."}
{"main_page": "https://arxiv.org/abs/2510.18320", "pdf": "https://arxiv.org/pdf/2510.18320", "title": "Title:\n          The implications of inflation for the last ACT", "authors": "Zhi-Chong Qiu, Ye-Huang Pang, Qing-Guo Huang", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We explored a parameterized slow-roll inflationary model within the $\\Lambda$CDM framework, utilizing a combination of data from Planck 2018, ACT DR6, DESI DR2, and BICEP/Keck 2018 (P-ACT-LB-BK18). Additionally, we incorporated the SH0ES prior on $H_0$ (P-ACT-LB-BK18-$H_0$) to analyze the model within the early dark energy (EDE) framework. While the model with a potential $V(\\phi)\\propto \\phi^\\alpha$ for small values of $\\alpha$ still fits the data, the Starobinsky $R^2$ inflation falls outside the $2\\sigma$ region. On the other hand, in a self-consistent quantum theory of gravity, higher-order corrections to $R$ are typically anticipated. In response, we proposed a non-perturbative exponential $f(R)$ inflation model, wherein the subleading corrections beyond $R^2$ including terms like $R^3$ or $R^4$. Using numerical calculations and Markov Chain Monte Carlo (MCMC) analysis with the P-ACT-LB-BK18 data set, we demonstrate that this model can align well with the ACT-preferred value of the scalar spectral index. Additionally, within the early dark energy (EDE) framework, it accommodates greater deviations from the original Starobinsky $R^2$ inflation model when incorporating the SH0ES prior on $H_0$."}
{"main_page": "https://arxiv.org/abs/2510.18343", "pdf": "https://arxiv.org/pdf/2510.18343", "title": "Title:\n          The selection function of the Gaia DR3 open cluster census", "authors": "Emily L. Hunt, Tristan Cantat-Gaudin, Friedrich Anders, Sagar Malhotra, Lorenzo Spina, Alfred Castro-Ginard, Lorenzo Cavallo", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Open clusters are among the most useful and widespread tracers of Galactic structure. The completeness of the Galactic open cluster census, however, remains poorly understood. For the first time ever, we establish the selection function of an entire open cluster census, publishing our results as an open-source Python package for use by the community. Our work is valid for the Hunt & Reffert catalogue of clusters in Gaia DR3. We developed and open-sourced our cluster simulator from our first work. Then, we performed 80,590 injection and retrievals of simulated open clusters to test the Hunt & Reffert catalogue's sensitivity. We fit a logistic model of cluster detectability that depends only on a cluster's number of stars, median parallax error, Gaia data density, and a user-specified significance threshold. We find that our simple model accurately predicts cluster detectability, with a 94.53\\% accuracy on our training data that is comparable to a machine-learning based model with orders of magnitude more parameters. Our model itself offers numerous insights on why certain clusters are detected. We briefly use our model to show that cluster detectability depends on non-intuitive parameters, such as a cluster's proper motion, and we show that even a modest 25 km/s boost to a cluster's orbital speed can result in an almost 3$\\times$ higher detection probability, depending on its position. In addition, we publish our raw cluster injection and retrievals and cluster memberships, which could be used for a number of other science cases -- such as estimating cluster membership incompleteness. Using our results, selection effect-corrected studies are now possible with the open cluster census. Our work will enable a number of brand new types of study, such as detailed comparisons between the Milky Way's cluster census and recent extragalactic cluster samples."}
{"main_page": "https://arxiv.org/abs/2510.18382", "pdf": "https://arxiv.org/pdf/2510.18382", "title": "Title:\n          Acceleration of planetary migration: Resonance crossing and planetesimal ring", "authors": "Hailiang Li, Li-Yong Zhou, Xiaoping Zhang", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Planetary migration is a crucial stage in the early solar system, explaining many observational phenomena and providing constraints on details related to the solar system's origins. This paper aims to investigate the acceleration during planetary migration in detail using numerical simulations, delving deeper into the early solar system's preserved information. We confirm that planetary migration is a positive feedback process: the faster the migration, the more efficient the consumption of planetesimals; once the migration slows down, Neptune clears the surrounding space, making further migration more difficult to sustain. Quantitatively, a tenfold increase in migration rate corresponds to an approximately 30% reduction in the mass of planetesimals consumed to increase per unit angular momentum of Neptune. We also find that Neptune's final position is correlated with the initial surface density of planetesimals at that location, suggesting that the disk density at 30au was approximately 0.009$M_{\\oplus}/au^2$ in the early solar system. Two mechanisms that can accelerate planetary migration are identified: the first is MMR between Uranus and Neptune. Migration acceleration will be triggered whenever these two giant planets cross their major MMR. The second mechanism is the ring structure within the planetesimal disk, as the higher planetesimal density in this region can provide the material support necessary for migration acceleration. Our research indicates that Neptune in the current solar system occupies a relatively delicate position. In case Neptune crossed the 1:2 MMR with Uranus, it could have migrated to a much more distant location. Therefore, under the influence of the positive feedback mechanism, the evolution of the solar system to its current configuration might be a stochastic outcome rather than an inevitable consequence."}
{"main_page": "https://arxiv.org/abs/2510.18398", "pdf": "https://arxiv.org/pdf/2510.18398", "title": "Title:\n          A Census of Double-Peaked Lyman-alpha Emitters in MAGPI: Classification, Global Characteristics, and Spatially Resolved Properties", "authors": "Tamal Mukherjee, Tayyaba Zafar, Themiya Nanayakkara, Siddhartha Gurung-Lopez, Anshu Gupta, Scott M. Croom, Andrew Battisti, Karl Glazebrook, Polychronis Papaderos, Melissa Riggs, Emily Wisnioski, Caroline Foster, Katherine E. Harborne, Claudia D. P. Lagos, Trevor Mendel, Jahang Prathap, Stefania Barsanti, Sarah M. Sweet, Lucas M. Valenzuela, Anilkumar Mailvaganam", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Double-peaked Lyman-$\\alpha$ (Ly$\\alpha$) profiles provide critical insights into gas kinematics and the distribution of neutral hydrogen (HI) from the interstellar to the intergalactic medium (ISM to IGM), and serve as valuable diagnostics of ionising Lyman continuum (LyC) photon escape. We present a study of the global and spatially resolved properties of double-peaked Ly$\\alpha$ emitters (LAEs) based on VLT/MUSE data from the MAGPI survey. From a parent sample of 417 LAEs at z = 2.9 - 6.6 in the first 35 fields, we identify 108 double-peaked LAEs using an automated peak classification technique. We measure a double-peak fraction of $\\sim37\\%$ at $z < 4$, decreasing to $\\sim14\\%$ at $z > 4$, likely due to enhanced IGM attenuation. Approximately $17\\%$ of the double-peaked LAEs are blue-dominated, suggesting gas inflows. The blue-to-total flux ratio exhibits a luminosity dependence: fainter lines generally show higher blue flux, though some luminous sources also show strong blue peaks. We find a narrowing of the red peak at $z > 4$, despite the presence of the blue peak, indicating intrinsic galaxy evolution rather than IGM attenuation. Several LAEs exhibit residual flux in the absorption trough, with normalised trough flux anticorrelating with peak separation, reflecting variations in HI column density. We further investigate spatially resolved properties of ten red-dominated LAEs with extended Ly$\\alpha$ halos. Despite azimuthal variations, both the blue-to-total flux ratio and normalised trough flux density increase with radius, while peak separation decreases. The red peak asymmetry shows only minor radial changes. These trends are consistent with variations in shell outflow velocity and HI column density across the halos. Based on peak separation, red peak asymmetry, and residual trough flux, we identify five LAEs as strong LyC-leaker candidates."}
{"main_page": "https://arxiv.org/abs/2510.18399", "pdf": "https://arxiv.org/pdf/2510.18399", "title": "Title:\n          Head-tail molecular clouds falling onto the Milky Way disk", "authors": "Mikito Kohno, Yasuo Fukui, Takahiro Hayakawa, Yasuo Doi, Rin I. Yamada, Fumika Demachi, Kazuki Tokuda, Hidetoshi Sano, Shinji Fujita, Rei Enokiya, Asao Habe, Kisetsu Tsuge, Atsushi Nishimura, Masato I.N. Kobayashi, Hiroaki Yamamoto, Kengo Tachihara", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We report discovery of two CO clouds which are likely falling down to the Galactic plane at more than $35$ km s$^{-1}$. The clouds show head-tail distributions elongated perpendicular to the Galactic plane at $l=331.6^{\\circ}$ and $b=0^{\\circ}$ as revealed by an analysis of the Mopra CO $J=$1-0 survey data. We derived the distance of the clouds to be $2.46 \\pm 0.18$ kpc based on the Gaia Data Release 3. The CO clouds have molecular masses of $4.8\\times 10^3\\ M_{\\odot}$ and $3.5\\times 10^3\\ M_{\\odot}$, respectively, and show kinetic temperature of 30-50 K as derived from the line intensities of the $^{13}$CO $J$=2-1, $^{12}$CO $J$=1-0, and $^{13}$CO $J$=1-0 emission. The temperature in the heads of the clouds is significantly higher than 10 K of the typical molecular clouds, although no radiative heat source is found inside or close to the clouds. Based on the results, we interpret that the present clouds are falling onto the Milky Way disk and are significantly heated up by the strong shock interaction with the disk HI gas. We suggest that the clouds represent part of the HI intermediate velocity clouds falling to the Galactic plane which were converted into molecular clouds by shock compression. This is the first case of falling CO clouds having direct observed signatures of the falling motion including clear directivity and shock heating. Possible implications of the CO clouds in the evolution of the Galactic interstellar medium are discussed."}
{"main_page": "https://arxiv.org/abs/2510.18445", "pdf": "https://arxiv.org/pdf/2510.18445", "title": "Title:\n          Discovery of Repeating Transitions in 25 Changing-look Active Galactic Nuclei", "authors": "Qian Dong, Zhi-Xiang Zhang, Wei-Min Gu, Mouyuan Sun, Wei-Jian Guo, Zhen-Yi Cai, Jun-Xian Wang, Yong-Gang Zheng", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The repeating changing-look active galactic nuclei (RCL AGNs) exhibit multiple appearances and disappearances of broad emission lines (BELs), whose underlying mechanism remains a puzzle. Expanding the sample of RCL AGNs is valuable for constraining the transition timescale and probing the accretion physics driving CL behaviors. This study aims to identify RCL AGNs using the multi-epoch spectroscopic data of confirmed CL AGNs from the Sloan Digital Sky Survey, Large Sky Area Multi-Object Fiber Spectroscopic Telescope, and Dark Energy Spectroscopic Instrument, supplemented with mid-infrared (MIR) light curves. Through selection criteria and visual inspection, we identify 25 RCL AGNs among 331 CL AGNs, corresponding to an occurrence rate of about $8\\%$, indicating that repeated transitions are not rare in CL AGNs. Among the 25 RCL AGNs, 19 are newly identified, which significantly expands the known RCL AGN sample. Based on the spectra and densely sampled MIR light curves, we derive reliable turn-on transition timescales for 19 RCL AGNs, and find no significant correlation between the timescale and the black hole mass."}
{"main_page": "https://arxiv.org/abs/2510.18495", "pdf": "https://arxiv.org/pdf/2510.18495", "title": "Title:\n          On the influence of component orbital motion on the photometric variability of DF Tau", "authors": "M.A. Burlak, K.N. Grankin, A.V. Dodin, N.V. Emelyanov, N.P. Ikonnikova, Ya.A. Lazovik, S.A. Lamzin, B.S. Safonov, I.A. Strakhov", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Based on the analysis of the long-term light curve of the young binary DF Tau spanning approximately 125 years, we infer that its brightness variations are associated with changes in the accretion rate from the circumstellar protoplanetary disk onto the primary. We have also substantially improved the orbital parameters of DF Tau, which enables us to align its secular light curve with the evolution of the binary's component separation. The relationship between the long-term brightness variations and the orbital motion of DF Tau, if present, appears to be inconsistent with theoretical predictions. Notably, similar discrepancies between theory and observations are also seen in other young binary systems. Furthermore, the source of the polarized radiation in the optical range is found to be located at a distance of $\\lesssim 0.5^{\\prime\\prime}$ from the star, with the polarization variability showing no dependence on the orbital phase."}
{"main_page": "https://arxiv.org/abs/2510.18498", "pdf": "https://arxiv.org/pdf/2510.18498", "title": "Title:\n          Unveiling the nature of HE 0107-5240", "authors": "E. Caffau, M. Steffen, P. Molaro, P. Bonifacio, N. Christlieb, D. S. Aguado, J. I. González Hernández, M. R. Zapatero Osorio, L. Monaco, M. Limongi, A. Chieffi, A. Falla, L. Roberti, A. J. Gallagher, M. Spite, P. François, H.-G. Ludwig, L. Sbordone, R. Lallement, C. Allende, R. Rebolo, S. Cristiani, G. Cupani, V. D'Odorico, C. J. A. P. Martins, D. Milaković, M. T. Murphy, N. J. Nunes, N. C. Santos, T. M. Schmidt", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The vast majority of the most iron-poor stars in the Galaxy exhibit a strong carbon enhancement, with C/H ratios only about two orders of magnitude below solar. This unusual chemical composition likely reflects the properties of the gas cloud from which these stars formed, having been enriched by one, or at most a few, supernovae. A remarkable member of this stellar class, HE 0107-5240 with [Fe/H]=-5.56, has been identified as part of a binary system. To constrain its orbital parameters, radial velocity monitoring has been carried out using the ESPRESSO spectrograph. Radial velocities were derived using cross-correlation with a template, taking advantage of the strong G-band feature. Combining all observations yielded a high signal-to-noise spectrum, which has been used to refine our understanding of the stellar chemical composition. Additionally, a co-added UVES spectrum in the blue was used to complement the wavelength coverage of ESPRESSO. Observations of HE 0107-5240 over a span of more than four years have yielded a revised orbital period of about 29 years. Updated elemental abundances have been determined for Sc, Cr, Co, and, tentatively, Al, along with a new upper limit for Be. The iron abundance has been derived from ionised Fe lines. Significant upper limits have been established for Li, Si, and Sr. The star is confirmed to be a long-period binary. Iron abundances derived from neutral and ionised lines are consistent with local thermodynamical equilibrium (LTE) assumption, casting doubt on published deviation from LTE corrections for Fe for this star. The heavy elements Sr and Ba remain undetected, confirming the classification of HE 0107-5240 as a carbon enhanced metal-poor and non enhanced in heavy elements (CEMP-no) star and supporting the absence of an n-capture element plateau at the lowest metallicities."}
{"main_page": "https://arxiv.org/abs/2510.18505", "pdf": "https://arxiv.org/pdf/2510.18505", "title": "Title:\n          Multi-band Photometric and spectroscopic analysis of the dwarf novae IU Leo", "authors": "Y. H. Chen, C. M. Duan, H. Shu", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "IU Leo was first identified as a cataclysmic variable star in 2006. Based on an image data and a distance value, we derived that the circumbinary envelope of IU Leo was $\\sim$3,745\\,AU on the optical band. According the multi-band photometric data, we calculated a $T_{eff}$ of a few hundred Kelvin for the circumbinary envelope of IU Leo. We reviewed the physical parameters of IU Leo and simulated the evolution process using a stellar evolution code MESA with $M_{1}$=0.982\\,$M_{\\bigodot}$, $M_{2}$=0.835\\,$M_{\\bigodot}$, and an orbital period of 0.376308\\,days. The evolved other parameters are basically consistent with the parameters in the literatures. Based on the quiescence Kepler Mission 2.0 light curve, the quiescence Transiting Exoplanet Survey Satellite light curve, and 89 Large Sky Area Multi-Object Fiber Spectroscopic Telescope medium resolution spectra, we derived an orbital period of 0.376307 $\\pm$ 0.000004\\,days, 0.3762 $\\pm$ 0.0001\\,days, and 0.3763\\,days for IU Leo respectively. These orbital periods are basically consistent with the results of previous studies. According to light curve of IU Leo from American Association of Variable Star Observers, we reported three new outburst spectra from the Large Sky Area Multi-Object Fiber Spectroscopic Telescope low resolution catalogue with part Balmer emission lines overlap on their absorption lines. Many H, He, C, N, O, Na, Mg, Si, and Ca neutral and ionized lines are identified, which are produced by different mechanisms. In the future, we will conduct more comprehensive and in-depth research on CVs based on multi-band photometric and spectroscopic data."}
{"main_page": "https://arxiv.org/abs/2510.18511", "pdf": "https://arxiv.org/pdf/2510.18511", "title": "Title:\n          GLEAM-300: The GaLactic and Extragalactic All-sky Murchison Widefield Array (GLEAM) survey at 300 MHz", "authors": "S. W. Duchesne, J. H. Cook, N. Hurley-Walker, A. J. M. Thomson, S. Paterson, C. J. Riseley, S. J. McSweeney, S. Mantovanini, G. Heald, T. M. O. Franzen, K. Ross, N. Seymour, R. B. Wayth, T. J. Galvin", "subjects": "Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "In this paper we present a wide-field radio survey at 300 MHz covering the sky from $-90^\\circ \\leq \\delta_\\text{J2000} \\lesssim +40^\\circ$ using the Murchison Widefield Array (MWA). This 300-MHz survey follows the Galactic and Extragalactic All-sky MWA (GLEAM) survey, and provides an additional comparatively high-frequency data point to existing multi-frequency (72-231 MHz) data. With this data release we provide mosaic images and a catalogue of compact source components. We use two-minute snapshot observations covering 2015-2016, combining overlapping two-minute snapshot images to provide full-sensitivity mosaic images with a median root-mean-square noise of $9.1_{-2.8}^{+5.5}$ mJy beam$^{-1}$ and median angular resolution of $128.8^{\\prime\\prime} \\times 112.5^{\\prime\\prime}$, with some position-dependent variation. We find a total of 338 080 unique Gaussian components across the mosaic images. The survey is the first at 300 MHz from the MWA covering the whole Southern Hemisphere. It provides a unique spectral data point that complements the existing GLEAM survey and the ongoing GLEAM-eXtended survey, and points toward results from the upcoming SKA-Low surveys."}
{"main_page": "https://arxiv.org/abs/2510.18528", "pdf": "https://arxiv.org/pdf/2510.18528", "title": "Title:\n          The Optical Study of the Eclipsing Polar SDSS J002637.06+242915.6", "authors": "V.Yu. Kochkina, A.I. Kolbin, T.A. Fatkhullin, A.S. Vinokurov, N.V. Borisov", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "We have analyzed phase-resolved photometric and spectroscopic observations of the eclipsing polar SDSS J002637.06+242915.6. The light curve has a M-shaped bright phase that was reproduced using a simple model of an accreting magnetic white dwarf. The hydrogen emission lines exhibit a narrow component formed on the irradiated hemispere of the donor. The Doppler tomography revealed differences in the positions of emission regions of hydrogen and HeII $\\lambda$4686 lines. The spectra exhibit a Zeeman absorption triplet of the H$\\alpha$ line, formed in the cold halo around the accretion spot at a magnetic field strength of $B = 15.1 \\pm 1.3$ MG. The spectra of the bright phase have a red cyclotron continuum, whose orbital variability has been interpreted within a simple model of an accretion spot. The modeling of the cyclotron continuum constrains the white dwarf's magnetic field to $B_{cyc} \\lesssim 45$ MG. The analysis of the eclipse light curve and the radial velocities of the irradiated hemisphere yielded estimates for the orbital inclination $77.2^\\circ \\le i \\le 80.6^\\circ$, the mass ratio $0.23 \\le q \\le 0.43$, and the white dwarf mass $0.72 \\ge M_1/M_\\odot \\ge 0.42$."}
{"main_page": "https://arxiv.org/abs/2510.18531", "pdf": "https://arxiv.org/pdf/2510.18531", "title": "Title:\n          Improved thermonuclear rate of $^{42}$Ti($p$,$γ$)$^{43}$V and its astrophysical implication in rp-process", "authors": "S. Q. Hou, C. Iliadis, M. Pignatari, J. B. Liu, T. C. L. Trueman, J.G. Li, X. X. Xu", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Accurate $^{42}$Ti($p$,$\\gamma$)$^{43}$V reaction rates are crucial for understanding the nucleosynthesis path of the rapid capture process (rp-process) that occurs in X-ray bursts. We aim to improve the thermonuclear rates of $^{42}$Ti($p$,$\\gamma$)$^{43}$V based on more complete resonance information and accurate direct component, together with the recently released nuclear masses data. We reevaluated the $^{42}$Ti($p$,$\\gamma$)$^{43}$V rate by the sum of the isolated resonance contribution instead of the Hauser-Feshbach statistical model. A Monte Carlo method is used to derive the uncertainties of new rates. The nucleosynthesis simulations are performed via the NuGrid post-processing code ppn. The new rates differ from previous estimations because of using a series of updated resonance parameters and direct S-factor. Compared with the previous results from Hauser-Feshbach statistical model, which assumes compound nucleus $^{43}$V with a sufficiently high-level density in the energy region of astrophysical interest, differences exist over the entire temperature region of rp-process interest, even up to 4 orders of magnitude. Using a trajectory with a peak temperature of 1.95$\\times$10$^9$ K, we perform the rp-process nucleosynthesis simulations to investigate the impact of the new rates. Our calculations show that the adoption of the new forward and reverse rates result in abundance variations for Sc and Ca by 128\\% and 49\\% respectively compared to the case using statistical model rates. On the other hand, the overall abundance pattern is not significantly affected. The results of using new rates also confirm that the rp-process path does not bypass the isotope $^{43}$V. It is found that the Hauser-Feshbach statistical model is inappropriate to the reaction rate evaluation for $^{42}$Ti($p$,$\\gamma$)$^{43}$V."}
{"main_page": "https://arxiv.org/abs/2510.18578", "pdf": "https://arxiv.org/pdf/2510.18578", "title": "Title:\n          CHEX-MATE: towards a consistent universal pressure profile and cluster mass reconstruction", "authors": "M. Muñoz-Echeverría, E. Pointecouteau, G. W. Pratt, J.-F. Macías-Pérez, M. Douspis, L. Salvati, I. Bartalucci, H. Bourdin, N. Clerc, F. De Luca, M. De Petris, M. Donahue, S. Dupourqué, D. Eckert, S. Ettori, M. Gaspari, F. Gastaldello, M. Gitti, A. Gorce, S. Ilić, S. T. Kay, J. Kim, L. Lovisari, B. J. Maughan, P. Mazzotta, L. McBride, J.-B. Melin, F. Oppizzi, E. Rasia, M. Rossetti, H. Saxena, J. Sayers, M. Sereno, M. Tristram", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "In a self-similar paradigm of structure formation, the thermal pressure of the hot intra-cluster gas follows a universal distribution once the profile of each cluster is normalised based on the proper mass and redshift dependencies. The reconstruction of such a universal pressure profile requires an individual estimate of the mass of each cluster. In this context, we present a method to jointly fit, for the first time, the universal pressure profile and individual cluster $M_{500}$ masses over a sample of galaxy clusters, properly accounting for correlations between the profile shape and amplitude, and masses scaling the individual profiles. We demonstrate the power of the method and show that a consistent exploitation of the universal pressure profile and cluster mass estimates when modelling the thermal pressure in clusters is necessary to avoid biases. In particular, the method, informed by a cluster mass scale, outputs individual cluster masses with same accuracy and better precision than input masses. Using data from the «Cluster HEritage project with XMM-Newton: Mass Assembly and Thermodynamics at the Endpoint of structure formation», we investigate a sample of $\\sim 25$ galaxy clusters spanning mass and redshift ranges of $2 \\lesssim M_{500}/10^{14} \\; \\mathrm{M}_{\\odot} \\lesssim 14$ and $0.07 < z < 0.6$."}
{"main_page": "https://arxiv.org/abs/2510.18587", "pdf": "https://arxiv.org/pdf/2510.18587", "title": "Title:\n          Locked In Ice: how Pebble Drift and Volatile Entrapment can Significantly Impact Carbon and Oxygen Ratios in Evolving Protoplanetary Discs", "authors": "Joe Williams, Sebastiaan Krijt, Bertram Bitsch, Adrien Houge, Jennifer Bergner", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "The complex interplay between the growth, drift, and sublimation of ice-covered pebbles can strongly influence the volatile distribution and evolution of disc composition, and therefore impact the composition of forming planets. Classic pebble drift models treat volatile species individually as sublimating at their respective snowlines, although observations from the James Webb Space Telescope (JWST) suggest that ices are likely mixed; laboratory studies suggest ice mixtures can exhibit more complex sublimation behaviours, remaining trapped beyond their nominal sublimation temperatures. We present the first model that couples pebble growth and drift with CO entrapment inside water ice - preventing a fraction (up to ~60%) of the CO from sublimating at its snowline, instead desorbing via volcanic desorption at the water crystallisation front, at 130K. Our models show that CO entrapment will significantly impact the carbon and oxygen distributions, enhancing the gas-phase C/O and C/H inside the water snowline by up to a factor of 10 over 1 Myr and a factor of a few around the CO2 snowline; O/H is also increased around the CO2 snowline, but is water-dominated in the inner disc. Entrapment therefore provides a means of introducing more carbon to the inner disc whilst retaining a large amount of water. We discuss connections to planet formation, noting that CO entrapment can increase the gas-phase heavy element content around the water snowline by up to 150%. We also consider links to JWST observations and highlight the importance of entrapment for pebble drift models to accurately model disc composition."}
{"main_page": "https://arxiv.org/abs/2510.18595", "pdf": "https://arxiv.org/pdf/2510.18595", "title": "Title:\n          J-PAS: forecast on the primordial power spectrum reconstruction", "authors": "Guillermo Martínez-Somonte, Airam Marcos-Caballero, Enrique Martínez-González, Antonio L. Maroto, Miguel Quartin, Raul Abramo, Jailson Alcaniz, Narciso Benítez, Silvia Bonoli, Saulo Carneiro, Javier Cenarro, David Cristóbal-Hornillos, Simone Daflon, Renato Dupke, Alessandro Ederoclite, Rosa María González Delgado, Antonio Hernán-Caballero, Carlos Hernández-Monteagudo, Jifeng Liu, Carlos López-Sanjuán, Antonio Marín-Franch, Claudia Mendes de Oliveira, Mariano Moles, Fernando Roig, Laerte Sodré Jr., Keith Taylor, Jesús Varela, Héctor Vázquez Ramió, José M. Vilchez, Javier Zaragoza-Cardiel", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We investigate the capability of the J-PAS survey to constrain the primordial power spectrum using a non-parametric Bayesian method. Specifically, we analyze simulated power spectra generated by a local oscillatory primordial feature template motivated by non-standard inflation. The feature is placed within the range of scales where the signal-to-noise ratio is maximized, and we restrict the analysis to $k \\in [0.02,0.2] \\text{ h} \\text{ Mpc}^{-1}$, set by the expected J-PAS coverage and the onset of non-linear effects. Each primordial power spectrum is reconstructed by linearly interpolating $N$ knots in the $\\{\\log k, \\log P_{\\mathcal{R}}(k)\\}$ plane, which are sampled jointly with the cosmological parameters $\\{H_0,\\Omega_b h^2, \\Omega_c h^2\\}$ using PolyChord. To test the primordial features, we apply two statistical tools: the Bayes factor and a hypothesis test that localizes the scales where features are detected. We assess the recovery under different J-PAS specifications, including redshift binning, tracer type, survey area, and filter strategy. Our results show that combining redshift bins and tracers allows the detection of oscillatory features as small as 2\\%."}
{"main_page": "https://arxiv.org/abs/2510.18626", "pdf": "https://arxiv.org/pdf/2510.18626", "title": "Title:\n          Transitional Spectral Behavior in Blazar OJ 287: A Comprehensive Multi-Epoch SED Study", "authors": "Navaneeth P K, Gopal Bhatta, Sangeetha Kizhakkekalam", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We present a comprehensive multi-wavelength investigation of BL Lac object OJ 287 using Swift and Fermi observatories spanning 2008-2025. The source exhibits significant flux variability across optical-UV, X-ray, and $\\gamma$-ray regimes, with outbursts observed in optical, UV and X-ray frequencies. Variability and correlation analyses of the long-term lightcurves reveal strong correlations among optical, UV, and X-ray bands, whereas there is no significant correlation between $\\gamma$-ray and other bands. Using a decade-long dataset (MJD 57382-60448), we analysed X-ray spectral variability across different flux states (flare, intermediate, and quiescent). Multi-wavelength spectral energy distributions (SEDs) were constructed using a one-zone leptonic model to investigate the transitional nature of the X-ray spectral position in the broadband. The analysis reveals OJ 287's consistent flux-dependent transitional spectral behavior: quiescent states show hard X-ray spectra dominated by inverse Compton emission; intermediate states exhibit contributions from both inverse Compton and synchrotron components with moderately hard spectra; flaring events are characterized by predominantly synchrotron emission, resulting in soft X-ray spectra. Broadband SED modelling captures the systematic evolution of model parameters across different activity states, with correlation analysis revealing strong positive correlations between synchrotron peak frequency, Synchrotron-Self Compton peak frequency, and X-ray flux, providing quantitative evidence for the changing dominance of emission components within the blazar's relativistic jet."}
{"main_page": "https://arxiv.org/abs/2510.18657", "pdf": "https://arxiv.org/pdf/2510.18657", "title": "Title:\n          Line-force driven wind from a thin disk in tidal disruption event", "authors": "De-Fu Bu, Xiao-Hong Yang, Liang Chen, Chenwei Yang, Guobin Mou", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Winds from the accretion disk in tidal disruption events (TDEs) play a key role in determining the radiation of TDEs. The winds from the super-Eddington accretion phase in TDEs have recently been studied. However, properties of the winds from the sub-Eddington accretion disk in TDEs are not clear. We aim to investigate properties of winds from the circularized sub-Eddington accretion disk in TDEs. We study the line force driven accretion disk wind. We perform two-dimensional hydrodynamic simulations using the PLUTO code to study the line force driven wind from the circularized accretion disk around a $10^6$ solar mass black hole in TDEs. We find that although the disk has a very small size in TDEs, strong wind can be driven by line force when the disk have luminosity higher than $20\\%$ of the Eddington luminosity. The maximum velocity of wind can be as high as $0.3$ times the speed of light. The kinematic power of wind is in the range of $1\\%-6\\%$ times the Eddington luminosity. Strong wind can be driven by line force from the thin disk around a $10^6$ solar mass black hole in TDEs. We briefly discuss the possible radio emission from the shock when the wind collides with the surrounding medium."}
{"main_page": "https://arxiv.org/abs/2510.18695", "pdf": "https://arxiv.org/pdf/2510.18695", "title": "Title:\n          Assessing the performance of future space-based detectors: astrophysical foregrounds and individual sources", "authors": "Alice Perego, Matteo Bonetti, Alberto Sesana, Silvia Toonen, Valeriya Korol", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "The space mission LISA (Laser Interferometer Space Antenna), scheduled for launch in 2035, aims to detect gravitational wave (GW) signals in the milli-Hz band. In the context of ESA Voyage 2050 Call for new mission concepts, other frequency ranges are explored by the Gravitational-Wave Space 2050 Working Group to conceive new proposals for a post-LISA space-based detector. In this work, we give a preliminary estimate of the observational potential of three mission designs proposed in the literature, namely $\\mu$Ares, AMIGO and the Decihertz Observatory. The analysis framework includes astrophysical GW sources such as massive black hole binaries, extreme mass-ratio inspirals and compact binaries such as stellar black holes and white dwarfs. For each detector, we first present a consistent computation of the unresolved gravitational wave background (GWB) produced by the sum of all anticipated astrophysical populations, using an iterative subtraction algorithm. We then investigate which types of systems are the most appealing, by measuring the number of GW signals detected and exploring the source properties."}
{"main_page": "https://arxiv.org/abs/2510.18702", "pdf": "https://arxiv.org/pdf/2510.18702", "title": "Title:\n          Diurnal temperature variations and migrating thermal tides in the Martian lower atmosphere observed by the Emirates Mars InfraRed Spectrometer", "authors": "Siteng Fan, François Forget, Michael D. Smith, R. John Wilson, Sandrine Guerlet, Khalid M. Badri, Samuel A. Atwood, Roland M. B. Young, Christopher S. Edwards, Philip R. Christensen, Justin Deighan, Hessa R. Al Matroushi, Antoine Bierjon, Jiandong Liu, Ehouarn Millour", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "The Martian atmosphere experiences large diurnal variations due to the ~24.6 h planetary rotation and its low heat capacity. Understanding such variations on a planetary scale is limited due to the lack of observations, which are greatly addressed with the recent advent of the Emirates Mars Mission (EMM). As a result of its unique high-altitude orbit, instruments onboard are capable of obtaining a full geographic and local time coverage of the Martian atmosphere every 9-10 Martian days, approximately ~5° in solar longitude (LS). This enables investigations of the diurnal variation of the current climate on Mars on a planetary scale without significant local time (LT) gaps or confusions from correlated seasonal variations. Here, we present the results of diurnal temperature variations and thermal tides in the Martian atmosphere using temperature profiles retrieved from the Emirates Mars InfraRed Spectrometer (EMIRS) observations. The data during the primary mission is included, covering an entire Martian Year (MY) starting from MY 36 LS = 49°. The diurnal temperature patterns suggest a dominant diurnal tide in most seasons, while the semi-diurnal tide presents a similar amplitude near perihelion. The seasonal variation of the diurnal tide latitudinal distribution is well explained by the total vorticity due to zonal wind, while that of the semi-diurnal tide following both dust and water ice clouds, and the ter-diurnal tide following the dust only. Comparison with the updated Mars Planetary Climate Model (PCM, version 6) suggest improvements in simulating the dust and water cycles, as well as their radiative processes."}
{"main_page": "https://arxiv.org/abs/2510.18704", "pdf": "https://arxiv.org/pdf/2510.18704", "title": "Title:\n          Chemistry, Climate, and Transmission Spectra of TRAPPIST-1 e Explored with a Multimodel Sparse Sampled Ensemble", "authors": "Eric T. Wolf, Edward W. Schwieterman, Jacob Haqq-Misra, Thomas J. Fauchez, Sandra T. Bastelberger, Michaela Leung, Sarah Peacock, Geronimo L. Villanueva, Ravi K. Kopparapu", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "TRAPPIST-1 e is one of a few habitable zone exoplanets that is amenable to characterization in the near term. In this study our motivations are both scientific and technical. Our technical goal is to establish a multimodel sparse sampled ensemble approach for coherently exploring large unconstrained parameter spaces typical in exoplanet science. Our science goal is to determine relationships that connect observations to the underlying climate across a large parameter space of atmospheric compositions for TRAPPIST-1 e. We consider atmospheric compositions of N2, CO2, CH4, and H2O, with water clouds and photochemical hazes. We use a 1D photochemical model, a 3D climate model, and a transmission spectral model, filtered through a quasi-Monte Carlo sparse sampling approach applied across atmospheric compositions. While clouds and hazes have significant effects on the transmission spectra, CO2 and CH4 can be potentially detected in <10 transits for certain compositional and climate states. Colder climates have better prospects for characterization, due to being relatively dry and having fewer clouds, permitting transmission observations to probe more deeply into their atmospheres. CH4 volume mixing ratios of >$10^{-3}$ trigger strong antigreenhouse cooling, where near-IR absorption simultaneously creates an inversion in the stratosphere and reduces the stellar radiation reaching the planet surface. In such cases, interpreting the disk-averaged emission and albedo at face value can yield misleading conclusions, as here low albedo and high thermal emission are associated with cold planets. Future work will use our sparse sampling approach to explore broader parameter spaces and other observationally amenable exoplanets."}
{"main_page": "https://arxiv.org/abs/2510.18706", "pdf": "https://arxiv.org/pdf/2510.18706", "title": "Title:\n          Binding energy of compact stars and their non-radial oscillations", "authors": "P. Laskos-Patkos, S. Papadopoulos, Ch. C. Moustakidis", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th)", "abstract": "In the past years, a significant effort has been made with the scope of determining correlations, involving compact star properties, that are independent of the nuclear equation of state. Such universal relations are of utmost importance as they allow for the imposition of constraints on stellar properties without directly measuring them and they may also serve as a probe of General Relativity. In the present study, we investigated the possible existence of a universal relation between the binding energy of compact stars and the frequency of their non-radial oscillations. The main motivation was related to the fact that both of the aforementioned quantities might be measured in the occurrence of a supernova explosion. Interestingly, we found that there is a empirical relation between the oscillation frequency and the binding energy for both $f$ and $p_1$ modes, assuming hadronic stellar matter. The inclusion of hybrid equations of state, incorporating sharp phase transitions, was shown to result into deviations from the aforementioned quasi-universal relation."}
{"main_page": "https://arxiv.org/abs/2510.18727", "pdf": "https://arxiv.org/pdf/2510.18727", "title": "Title:\n          Gravitational-wave and electromagnetic detections in the context of the CosmoDC2 LSST synthetic catalog", "authors": "Ranier Menote, Valerio Marra, Riccardo Sturani, Felipe Andrade-Oliveira, Clécio R. Bom, The LSST Dark Energy Science Collaboration", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We release CosmoDC2_BCO, a synthetic catalog of gravitational-wave events and electromagnetic counterparts associated with galaxies from CosmoDC2. The catalog provides intrinsic and extrinsic source parameters, signal-to-noise ratios, parameter uncertainties, sky localization areas, and kilonova apparent magnitudes in LSST filters. Our results show that third-generation detector networks substantially increase detection rates and improve parameter estimation. Second-generation detectors, when combined with third-generation ones, significantly enhance sky localization and distance precision, particularly for BNS mergers. Assuming a simplified Target of Opportunity strategy, we estimate that an LSST-like survey, partnered with the CE+ET+LVK network at 70% duty cycle, could detect about 5000 kilonovae with GW counterparts over a 10-year period on a 16000 deg^2 footprint, predominantly from low-mass BNS mergers that produce long-lived supermassive neutron star remnants. While this is a substantial number, it represents only a small fraction of the total neutron star mergers expected to be observed by third-generation networks. These projections rely on several simplifying assumptions-including the adopted merger rate, the kilonova luminosity distribution, and the configuration and scheduling of future surveys-which introduce notable uncertainties. Therefore, the estimated detection numbers should be interpreted with appropriate caution."}
{"main_page": "https://arxiv.org/abs/2510.18741", "pdf": "https://arxiv.org/pdf/2510.18741", "title": "Title:\n          Nonlinear Matter Power Spectrum from relativistic $N$-body Simulations: $Λ_{\\rm s}$CDM versus $Λ$CDM", "authors": "Özgür Akarsu, Eleonora Di Valentino, Jiří Vyskočil, Ezgi Yılmaz, A. Emrah Yükselci, Alexander Zhuk", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "We present relativistic $N$-body simulations of a $\\Lambda_{\\rm s}$CDM - sign-switching cosmological constant (CC) - scenario under general relativity and compare its nonlinear matter power spectrum to $\\Lambda$CDM at ${z = 15,\\,2,\\,1,\\,0}$, using best-fit parameters from Planck-only and a combined ''full'' dataset. During the AdS-like CC ($\\Lambda_{\\rm s}<0$) phase, prior to the transition redshift $z_\\dagger$, reduced Hubble friction dynamically enhances the growth of perturbations; after the switch, with dS-like CC ($\\Lambda_{\\rm s}>0$), the larger late-time expansion rate partly suppresses, but does not erase, the earlier amplification. Consequently, the ratio $P_{\\Lambda_{\\rm s}\\rm CDM}/P_{\\Lambda\\rm CDM}$ exhibits a pronounced, redshift-dependent shape feature: a crest peaking at ${\\sim 20-25\\%}$ around ${k \\simeq 1-3\\,h\\,\\mathrm{Mpc}^{-1}}$ near the transition, which then migrates to larger physical scales and persists to ${z = 0}$ as a robust ${\\sim 15-20\\%}$ uplift at ${k \\simeq 0.6-1.0\\,h\\,\\mathrm{Mpc}^{-1}}$. These wavenumbers correspond to group/poor-cluster environments and lie within the sensitivity range of weak lensing, galaxy-galaxy lensing, cluster counts, and tSZ power, providing a concrete, falsifiable target that cannot be mimicked by a scale-independent change in $\\sigma_8$ or $S_8$. The timing (earlier for Planck-only, later for the full dataset) and the amplitude of the crest align with the ''cosmic noon'' epoch (${z \\simeq 1-2}$), offering a gravitational prior for the observed peak in the cosmic star-formation rate."}
{"main_page": "https://arxiv.org/abs/2510.18742", "pdf": "https://arxiv.org/pdf/2510.18742", "title": "Title:\n          Nonthermal electron acceleration in turbulent post-flare coronal loops", "authors": "Clarissa Mora, Fabio Bacchini, Rony Keppens", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "The generation of nonthermal electrons during solar flares plays a critical role in energy transport from the corona to the chromosphere, producing regions of observed intense X-ray emission. Turbulence in post-flare loops, particularly from Kelvin-Helmholtz instabilities (KHI), has been suggested and investigated as a mechanism for trapping and accelerating electrons in such scenarios. Starting from past results, we aim to characterize the energization process of electrons trapped in a turbulent post-flare looptop, quantifying the contributions of different acceleration mechanisms, and establishing a coherent numerical framework for describing particle energetics. We perform test-particle simulations with the guiding-centre approximation on top of a 2.5D magnetohydrodynamic model of a time-evolving post-flare coronal looptop. We implement an improved formulation of the guiding-centre equations that explicitly conserves energy, enabling a consistent analysis of electron acceleration in the turbulent plasma. We find that, in the plasma turbulence inside the looptop, electrons develop suprathermal energy distributions with tails compatible with hard X-ray emission. The dominant energization channel arises from perpendicular gradient effects in the form of second-order Fermi-like stochastic acceleration, while curvature effects are dominant for particles on long trajectories. Statistical correlations with the measured particle pitch angle confirm that the strongest acceleration occurs for electrons trapped in bouncing motions within turbulent magnetic structures. Our results provide an understanding of how KHI-induced turbulence in coronal looptops produces and sustains populations of trapped nonthermal electrons. We dissect and clarify the relative roles of different magnetic effects and the emergence of stochastic Fermi-like energization."}
{"main_page": "https://arxiv.org/abs/2510.18749", "pdf": "https://arxiv.org/pdf/2510.18749", "title": "Title:\n          Symbolic Emulators for Cosmology: Accelerating Cosmological Analyses Without Sacrificing Precision", "authors": "Deaglan J. Bartlett, Shivam Pandey", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)", "abstract": "In cosmology, emulators play a crucial role by providing fast and accurate predictions of complex physical models, enabling efficient exploration of high-dimensional parameter spaces that would be computationally prohibitive with direct numerical simulations. Symbolic emulators have emerged as promising alternatives to numerical approaches, delivering comparable accuracy with significantly faster evaluation times. While previous symbolic emulators were limited to relatively narrow prior ranges, we expand these to cover the parameter space relevant for current cosmological analyses. We introduce approximations to hypergeometric functions used for the $\\Lambda$CDM comoving distance and linear growth factor which are accurate to better than 0.001% and 0.05%, respectively, for all redshifts and for $\\Omega_{\\rm m} \\in [0.1, 0.5]$. We show that integrating symbolic emulators into a Dark Energy Survey-like $3\\times2$pt analysis produces cosmological constraints consistent with those obtained using standard numerical methods. Our symbolic emulators offer substantial improvements in speed and memory usage, demonstrating their practical potential for scalable, likelihood-based inference."}
{"main_page": "https://arxiv.org/abs/2510.18752", "pdf": "https://arxiv.org/pdf/2510.18752", "title": "Title:\n          Probing cosmology with bright sirens from the CosmoDC2_BCO LSST synthetic catalog", "authors": "Ranier Menote, Valerio Marra", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Bright sirens, i.e. gravitational-wave detections of compact binary mergers with electromagnetic counterparts, provide a self-calibrated distance-redshift relation and are therefore powerful probes of cosmic expansion. Using the CosmoDC2_BCO catalog, we forecast cosmological constraints from current (LVK) and next-generation (ET, CE) detector networks, in combination with a Roman-like Type Ia supernova sample. We find that third-generation networks reach sub-percent precision on the Hubble constant within a few years, achieving 0.2% after a decade with CE+ET+LVK, while LVK remains limited to the 6% level. The LVK fifth observing run may shed light on the H_0 tension only if the inferred value falls outside the range spanned by the Planck and SH0ES determinations, which currently achieve far higher precisions. Supernovae do not directly tighten H_0 but stabilize its inference through parameter correlations and enable an absolute calibration of the supernova magnitude M_B. In dynamical dark-energy models, the joint analysis of Roman supernovae and bright sirens yields a Figure of Merit of 25 for ET+LVK and 76 for CE+ET+LVK, to be compared with the state-of-the-art DESI DR2 BAO plus DESY5 supernovae value of 56. Sky-localization thresholds of DeltaOmega < 50 deg^2, or even DeltaOmega < 10 deg^2, entail only mild penalties, suggesting efficient follow-up strategies. These results establish third-generation GW+EM observations, especially when combined with Roman supernovae, as a cornerstone for precision cosmology in the next decade."}
{"main_page": "https://arxiv.org/abs/2510.18757", "pdf": "https://arxiv.org/pdf/2510.18757", "title": "Title:\n          A Detailed Chemical Analysis of the Red Giant Orbiting the Black Hole $Gaia$ BH3: From Lithium to Thorium", "authors": "Zoe Hackshaw, Keith Hawkins, Catherine Manea", "subjects": "Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Preliminary astrometric data from the fourth data release of the $Gaia$ mission revealed a 33 M$_{\\odot}$ dark companion to a metal-poor red giant star, deemed $Gaia$ BH3. This system hosts both the most massive known stellar-origin black hole and the lowest-metallicity star yet discovered in orbit around a black hole. The formation pathway for this peculiar stellar-black hole binary system has yet to be determined, with possible production mechanisms that include isolated binary evolution and dynamical capture. The chemical composition of the stellar companion in $Gaia$ BH3 (hereafter \\bhstar) can help constrain the potential formation mechanisms of this system. Here, we conduct the most comprehensive chemical analysis of \\bhstar\\ to date using high resolution spectra obtained by the Tull Coudé Spectrograph on the 2.7m Harlan J. Smith Telescope at McDonald Observatory to constrain potential formation mechanisms. We derived 29 elemental abundances ranging from lithium to thorium and find that \\bhstar\\ is an $\\alpha$-enriched ([$\\alpha$/Fe] = 0.41), r-I neutron-capture star ([Eu/Fe] = 0.57). We conclude that \\bhstar\\ shows no chemical peculiarities (defined as deviations from the expected chemical pattern of an r-I halo red giant) in any elements, which is in alignment with both the dynamical capture and isolated binary evolution formation scenarios. With an upper limit detection on Th, we use the Th/Eu chronometer to place limits on the cosmochronometric age of this system. These observations lay the groundwork for heavy-element chemical analysis for subsequent black hole and low-metallicity stellar binaries that will likely be found in $Gaia$ DR4."}
{"main_page": "https://arxiv.org/abs/2510.18763", "pdf": "https://arxiv.org/pdf/2510.18763", "title": "Title:\n          Particle acceleration at radiative supernova remnant shocks", "authors": "Pierre Cristofari", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Numerous astrophysical shock waves evolve in an environment where the radiative cooling behind the shock affects the hydrodynamical structure downstream, thereby influencing the potential for particle acceleration via diffusive shock acceleration (DSA). We study the possibility for DSA to energize particles from the thermal pool and from pre-existing cosmic rays at radiative shocks, focusing on the case of supernova remnants (SNRs). We rely on a semi-analytical description of particle acceleration at collisionless shocks in the test-particle limit, estimating the total proton and electron content from SNRs throughout the radiative phase. Our results indicate that DSA can lead to significant particle acceleration during the first few tens of kyrs of the radiative phase. Although the associated multi-wavelength emission from SNRs in the radiative phase may not be detectable with current observatories in most cases, the radiative phase is found to lead to substantial deviations from the canonical p$^{-4}$ of the test-particle limit. The hardening/steepening is due to an interplay between a growing contribution of the reaccelerated term as the SNR volume expands and the effects of adiabatic and radiative losses on trapped particles as particles are confined for a longer time. The slope of the cumulative proton and electron spectra over the SNR lifetime thus depends on the environment in which the SNR shock propagates, and on the duration of the radiative phase during which DSA can take place. Overall, DSA in the radiative phase can lead to a total electron spectrum steeper than the proton spectrum, both at SNRs from thermonuclear and core-collapse SNe. Finally, we comment on the case of young radiative SNRs (in the first month to a few years after the explosion) for which the denser environments (with mass-loss rates of $\\dot{M} \\sim 10^{-1} - 1$ M$_{\\odot}$/yr) tend to inhibit DSA."}
{"main_page": "https://arxiv.org/abs/2510.18764", "pdf": "https://arxiv.org/pdf/2510.18764", "title": "Title:\n          Linking Electron Density with Elevated Star Formation Activity from $z=0$ to $z=10$", "authors": "Sijia Li, Si-Yue Yu, Luis C. Ho, John D. Silverman, Jing Wang, Amelie Saintonge, Niankun Yu, Qinyue Fei, Daichi Kashino, Hao-ran Yu", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The interstellar medium (ISM) in high-redshift galaxies exhibits significantly higher electron densities ($n_{\\rm e}$) than in the local universe. To investigate the origin of this trend, we analyze a sample of 9590 centrally star-forming galaxies with stellar masses greater than $10^9\\,M_\\odot$ at redshifts $0.01 < z < 0.04$, selected from the Dark Energy Spectroscopic Instrument (DESI) Data Release 1. We derive electron densities from the [S~II]~$\\lambda\\lambda6716,6731$ doublet, measuring values of $n_{\\rm e} = 30$-$400~{\\rm cm^{-3}}$ at $z \\approx 0$. We find a tight correlation between $n_{\\rm e}$ and the star formation rate surface density ($\\Sigma_{\\rm SFR}$), which is well described by a broken power law. Above a threshold of $\\log(\\Sigma_{\\rm SFR} / M_\\odot\\,{\\rm yr^{-1}\\,kpc^{-2}}) \\ge -1.46$, the relation follows $n_{\\rm e} = (233 \\pm 13)\\,\\Sigma_{\\rm SFR}^{0.49 \\pm 0.02}$. Below this threshold, $n_{\\rm e}$ remains approximately constant at $44 \\pm 3~{\\rm cm^{-3}}$. Remarkably, this relation remains consistent with measurements of galaxies at $z = 0.9$-$10.2$. By converting the observed redshift evolution of $\\Sigma_{\\rm SFR}$ into $n_{\\rm e}$ evolution through our $n_{\\rm e}$-$\\Sigma_{\\rm SFR}$ relation, we obtain $n_{\\rm e} = 40(1+z)^{1.4}~{\\rm cm^{-3}}$, consistent with previous direct observations. The $n_{\\rm e}$-$\\Sigma_{\\rm SFR}$ relation likely arises because the high $\\Sigma_{\\rm SFR}$, fueled by dense cold gas or elevated efficiency, enhances radiative and mechanical feedback and produces dense ionized gas whose electron densities are further regulated by ambient pressure. We conclude that the redshift evolution of $n_{\\rm e}$ primarily reflects the evolution of cold gas density and star formation activity over cosmic time."}
{"main_page": "https://arxiv.org/abs/2510.18769", "pdf": "https://arxiv.org/pdf/2510.18769", "title": "Title:\n          Pre-perihelion Development of Interstellar Comet 3I/ATLAS", "authors": "David Jewitt, Jane Luu", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We describe pre-perihelion optical observations of interstellar comet 3I/ATLAS taken during July - September 2025 using the Nordic Optical Telescope. Fixed aperture photometry of the comet is well described by a power law function of heliocentric distance, rH, with the exponent (``index\") n = 3.8+/-0.3 across the 4.6 au to 1.8 au distance range (phase function 0.04+/-0.02 magnitude/degree assumed). This indicates that the dust production rates vary in proportion to rH**(-1.8+/-0.3). An rH**(-2) variation is expected of a strongly volatile material, and consistent with independent spectroscopic observations showing that carbon dioxide is the primary driver of activity. The measured heliocentric index is unremarkable in the context of solar system comets, for which n is widely dispersed, and provides no basis on which to describe 3I as either dynamically old (thermally processed) or new (pristine). The morphology of the comet changes from a Sun-facing dust fan in the early 2025 July observations, to one dominated by an antisolar dust tail at later dates. We attribute the delayed emergence of the tail to the large size (effective radius 0.1 mm) and slow ejection (5 m/s) of the optically dominant dust particles, and their consequently sluggish response to solar radiation pressure. Small (micron-sized) particles may be present but not in numbers sufficient to dominate the scattering cross-section. Their relative depletion possibly reflects interparticle cohesion, which binds small particles more effectively than large ones. A similar preponderance of 0.1 mm grains was reported in 2I/Borisov. However, 2I differed from 3I in having a much smaller (asteroid-like) heliocentric index, n = 1.9+/-0.1. Dust production rates in 3I are 180 kg/s at 2 au, compared with 70 kg/s in 2I/Borisov at the same distance."}
{"main_page": "https://arxiv.org/abs/2510.18782", "pdf": "https://arxiv.org/pdf/2510.18782", "title": "Title:\n          Multiple shells in supernova 2023ixf support the jittering jets explosion mechanism (JJEM)", "authors": "Noam Soker, Kobi Shiran (Technion, Israel)", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Examining the photospheric time evolution of the core-collapse supernova (CCSN) SN 2023ixf from the literature, we identify three evolutionary time periods with constant expansion velocities, which we attribute to three ejecta shells. We find that several CCSN remnants have morphologies with two or more complete or partial shells, compatible with the presence of two or three photospheric shells during the photospheric phase of the explosion. Studies have attributed these CCSN remnants to the jittering-jet explosion mechanism (JJEM), which involves two or three energetic pairs of jets participating in the explosion. We, therefore, conclude that the structure of the photospheric shells of SN 2023ixf supports its explosion by the JJEM. This study adds to the accumulating evidence that the JJEM is the primary explosion mechanism of CCSNE."}
{"main_page": "https://arxiv.org/abs/2510.18791", "pdf": "https://arxiv.org/pdf/2510.18791", "title": "Title:\n          Beware of the running $n_s$ when producing heavy primordial black holes", "authors": "Sasha Allegrini, Antonio J. Iovino, Hardi Veermäe", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "We examine single-field inflationary models for the formation of primordial black holes (PBHs). By analyzing the latest observations from the Atacama Cosmology Telescope (ACT)~\\cite{ACT:2025fju, ACT:2025tim}, we demonstrate that the observed preference for positive running ($\\alpha_s$) of the scalar spectral index $n_s$ imposes significant restrictions on the parameter space of ultra slow roll scenarios (USR). This tension becomes progressively pronounced for more massive PBHs, posing substantial challenges for USR models to yield a detectable PBH abundance, especially in the mass range probed by ongoing and future gravitational-wave experiments such as LIGO-Virgo-KAGRA (LVK) and the Einstein Telescope (ET). However, this discrepancy is minimal for asteroid-mass PBHs, which are still capable of feasibly constituting the entirety of dark matter (DM). To numerically probe the six-dimensional parameter space of polynomial models, we adapted a Markov Chain Monte Carlo (MCMC) approach to efficiently scan over the space of viable models. Our results further indicate that, in non-minimally coupled polynomial inflation, a viable cosmic microwave background (CMB) spectrum is best obtained at an inflection point for which second-order slow-roll approximation is necessary for precise CMB predictions."}
{"main_page": "https://arxiv.org/abs/2510.18797", "pdf": "https://arxiv.org/pdf/2510.18797", "title": "Title:\n          N-body Simulations of cosmologies with Light Massive Relics", "authors": "Vikhyat Sharma, Arka Banerjee", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The presence of additional relativistic particles at the time of recombination can be inferred through their contribution to $\\Delta N_{\\rm eff}$. If these species have a finite but low mass (Light Massive Relics - LiMRs), they act as a hot subcomponent of dark matter and impact late-time structure formation. Understanding these effects will be crucial to pin down the underlying particle physics properties of any future $\\Delta N_{\\rm eff}$ detection. While their impact has been well-studied on linear scales, this work develops the framework for and presents results from the first set of cosmological N-body simulations that can track the effects of LiMRs, as a function of their mass and temperature, down to fully nonlinear scales. Importantly, our simulations model the impact of both the massive Standard Model neutrinos and LiMRs, which will be crucial in disentangling possible degeneracies. We systematically explore the effects of LiMR properties such as mass, temperature, and initial distribution, on various cosmological observables, including the total matter power spectrum, Halo Mass Functions (HMF), Mass-Concentration relation, radial halo profiles, and weak lensing signals around massive clusters. The framework and simulations developed here will enable detailed follow-up of the rich phenomenology of LiMR cosmologies."}
{"main_page": "https://arxiv.org/abs/2510.18800", "pdf": "https://arxiv.org/pdf/2510.18800", "title": "Title:\n          The role of the secondary white dwarf in a double-degenerate double-detonation explosion, in the supernova remnant phase", "authors": "Gilles Ferrand, Rüdiger Pakmor, Yusei Fujimaru, Shiu-Hang Lee, Samar Safi-Harb, Shigehiro Nagataki, Friedrich K. Roepke, Anne Decourchelle, Ivo R. Seitenzahl, Daniel Patnaude", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Type Ia supernovae (SNe) are believed to be thermonuclear explosions of white dwarf (WD) stars, but their progenitor systems and explosion mechanisms are still unclear. Here we focus on double degenerate systems, where two WDs are interacting, and on the double detonation mechanism, where a detonation of a helium shell triggers a detonation of the carbon-oxygen core of the primary WD. We take the results from three-dimensional SN simulations of Pakmor et al 2022 (arXiv:2203.14990) and carry them into the supernova remnant (SNR) phase, until 1500 yr after the explosion. We reveal signatures of the SN imprinted in the SNR morphology. We confirm the impact of a companion on the SNR: its presence induces a conical shadow in the ejecta, that is long lived. Its intersection with the shocked shell is visible in projection as a ring, an ellipse, or a bar, depending on the orientation. New, we test the case of a nested explosion model, in which the explosion of the primary induces the secondary to also explode. As the explosion of the secondary WD is weaker only the primary outer ejecta interact with the ambient medium and form the main SNR shell. The secondary inner ejecta collide with the reverse shock, which enhances the density and thus the X-ray emissivity. The composition at the points of impact is peculiar, since what is revealed are the outer layers from the inner ejecta. This effect can be probed with spatially-resolved X-ray spectroscopy of young SNRs."}
{"main_page": "https://arxiv.org/abs/2510.18807", "pdf": "https://arxiv.org/pdf/2510.18807", "title": "Title:\n          Degeneracy-Aware Pulsar Parameter Estimation from Light Curves via Deep Learning and Test-Time Optimization", "authors": "Abu Bucker Siddik, Diane Oyen, Soumi De, Greg Olmschenk, Constantinos Kalapotharakos", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "Probing properties of neutron stars from photometric observations of these objects helps us answer crucial questions at the forefront of multi-messenger astronomy, such as, what is behavior of highest density matter in extreme environments and what is the procedure of generation and evolution of magnetic fields in these astrophysical environments? However, uncertainties and degeneracies-where different parameter sets produce similar light curves-make this task challenging. We propose a deep learning framework for inferring pulsar parameters from observed light curves. Traditional deep learning models are not designed to produce multiple degenerate solutions for a given input. To address this, we introduce a custom loss function that incorporates a light curve emulator as a forward model, along with a dissimilarity loss that encourages the model to capture diverse, degenerate parameter sets for a given light curve. We further introduce a test-time optimization scheme that refines predicted parameters by minimizing the discrepancy between the observed light curve and those reconstructed by the forward model from predicted parameters during inference. The model is trained using a suite of state-of-the-art simulated pulsar light curves. Finally, we demonstrate that the parameter sets predicted by our approach reproduce light curves that are consistent with the true observation."}
{"main_page": "https://arxiv.org/abs/2510.18820", "pdf": "https://arxiv.org/pdf/2510.18820", "title": "Title:\n          Ever Elusive Exospheres: One Probable Detection and Two Non-Detections of Hα Transits in Young Systems", "authors": "Reilly P. Milburn, Andrew W. Mann, Keighley Rockcliffe, Erin E. Flowers, Alexis Heitzmann, Benjamin T. Montet, George Zhou, Madyson G. Barber", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Gaps in the exoplanet population, such as the Neptunian Desert, point to the importance of mass-loss in sculpting the radii of close-in exoplanets. Young planets ($<$500Myr) offer the opportunity to detect such mass-loss while it is still strong, and to test models of the underlying physical processes. We search for evidence of an H$\\alpha$ transit in high-resolution spectra of three young planets, HD 63433b (400 Myr), DS TucAb (45 Myr), and HIP 67522b (17 Myr) using HARPS-N, Magellan-PFS, and CHIRON respectively. We validate our method by testing it on several photospheric lines less impacted by stellar variability. We find no evidence of a transit signal for HD 63433b and DS Tuc A b (3$\\sigma$ limits of 0.9% and 0.3%, respectively). For HIP 67522b, we detect significant excess absorption (3.44$\\pm$0.28%) aligned with the transit time, narrow compared to the stellar line, and blueshifted from the stellar rest frame. In combination, these suggest the signal is from the planet. However, stellar variation in the H$\\alpha$ line over the course of the observations is comparable in size to the transit signature and the duration is shorter than the photometric transit, so this detection requires confirmation. Our findings, and other recent results in the literature, suggest that planets younger than 50 Myr are more favorable for the detection of atmospheric escape with H$\\alpha$ observations, though older populations might still show escape in other diagnostics."}
{"main_page": "https://arxiv.org/abs/2510.18854", "pdf": "https://arxiv.org/pdf/2510.18854", "title": "Title:\n          AT2025ulz and S250818k: zooming in with the Hubble Space Telescope", "authors": "Yu-Han Yang, Eleonora Troja, Marko Ristić, Muskan Yadav, Massine El Kabir, Rubén Sánchez-Ramírez, Rosa L. Becerra, Chris L. Fryer, Brendan O'Connor, Simone Dichiara, Alberto J. Castro-Tirado, Camila Angulo-Valdez, Josefa Becerra González, José A. Font, Ori Fox, Lei Hu, Youdong Hu, William H. Lee, Margarita Pereyra, Alicia M. Sintes, Alan M. Watson, López Mendoza K. Océlotl C", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph)", "abstract": "AT2025ulz is an optical/near-infrared transient discovered during follow-up of the candidate gravitational wave (GW) event S250818k. Its young age ($\\lesssim$1 d), rapid decline and strong color evolution over the first 48 hr classify it as a potential kilonova candidate. In this work, we present the results of our observing campaign, carried out with the Gran Telescopio Canarias (GTC) and the Hubble Space Telescope (HST). Although the early time evolution of AT2025ulz resembles some aspects of a kilonova, its rapid onset ($\\sim$3 hr after the GW trigger) and luminosity (a factor of $\\sim5$ brighter than AT2017gfo in $g$-band) are difficult to reproduce. Only a small subset of our kilonova models matches its multi-color light curve, and the inferred ejecta mass is uncomfortably large given the low chirp mass ($\\lesssim\\!0.87\\!$ M$_{\\odot}$) of the GW candidate. HST observations place the transient within a nearby ($z=0.08489$) spiral galaxy with on-going star-formation and measure a color ($F336W-F160W\\!\\approx\\!1.4$ mag) that is too blue to match with a kilonova. Our data support the classification of AT2025ulz as a supernova, initially undergoing a shock-cooling phase and later entering its photospheric phase, and spectroscopically identified via its broad absorption features."}
{"main_page": "https://arxiv.org/abs/2510.18867", "pdf": "https://arxiv.org/pdf/2510.18867", "title": "Title:\n          Reexamining Evidence of a Pair-Instability Mass Gap in the Binary Black Hole Population", "authors": "Anarya Ray, Vicky Kalogera", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "The fourth gravitational wave transient catalog~(GWTC-4) has enabled empirical probes of the theorized pair-instability gap in the higher end of the binary black hole~(BBH) mass-spectrum. In this letter, using flexibly parametrized models, we show that at present there is no evidence of a sharp drop-off in the spectrum of black hole masses near $~40-50M_{\\odot}$. We simultaneously characterize the transition in the distribution of BBH mass-ratios, effective aligned and effective precessing spins using our flexible models. From the transitions in our inferred spin and mass-ratio distributions, we find that the high-mass broad-spin sub-population has a significant fraction~($52^{+18}_{-23}\\%$) of systems with mass ratios in the range $0.6-1$. This suggests that alternatives to the hypothesis of 2G+1G hierarchical systems dominating BBH formation above $\\sim 40-50 M_{\\odot}$ are more consistent with the GWTC-4 detection sample. By comparing with the predictions of star cluster simulations, we further show that contributions from (2G+2G) systems are not abundant enough to alleviate this discrepancy. We also demonstrate the effects of strong model assumptions on this inference, which can lead to biased astrophysical interpretation from restricted priors. We note that our results do not exclude that a high-mass gap may be identified as our sample size increases. We constrain the lower bound on the location of a possible PISN cutoff still allowed within measurement uncertainties to be $(57^{+17}_{-10}M_{\\odot})$ and discuss its implications on the S factor of $^{12}\\mathrm{C}(\\alpha, \\gamma)^{16}O$ at 300 kev."}
{"main_page": "https://arxiv.org/abs/2510.18868", "pdf": "https://arxiv.org/pdf/2510.18868", "title": "Title:\n          $B$-sure I: Minkowski functionals as robustness test for tensor-to-scalar ratio detection from CMB observations", "authors": "Claudio Ranucci, Alessandro Carones, Léo Vacher, Nicoletta Krachmalnicoff, Carlo Baccigalupi", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The detection of primordial $B$-mode polarisation of the Cosmic Microwave Background (CMB) is a major observational goal in modern Cosmology, offering a potential window into inflationary physics through the measurement of the tensor-to-scalar ratio $r$. However, the presence of Galactic foregrounds poses significant challenges, possibly biasing the $r$ estimate. In this study we explore the viability of using Minkowski functionals (MFs) as a robustness test to validate a potential $r$ detection by identifying non-Gaussian features associated with foregrounds contamination. To do so, we simulate sky maps as observed by a LiteBIRD-like CMB experiment, with realistic instrumental and foregrounds modelling. The CMB $B$-mode signal is recovered through blind component separation algorithms, and the obtained (biased) value of $r$ is used to generate Gaussian realisation of CMB signal. Their MFs are then compared with those computed on maps contaminated by foreground residual left by component separation, looking for a detection of non-Gaussianity. Our results demonstrate that, with the experimental configuration considered here, MFs can not be reliably adopted as a robustness test of an eventual $r$ detection, as we find that in the majority of the cases MFs are not able to raise significant warnings about the non-Gaussianity induced by the presence of foreground residuals. In the most realistic and refined scenario we adopted, the test is able to flag non-Gaussianity in $\\sim 26\\%$ of the simulations, meaning that there is no warning on the biased tensor-to-scalar ratio in $\\sim 74\\%$ of cases. These results suggest that more advanced statistics than MFs must be considered to look for non-Gaussian signatures of foregrounds, in order to be able to perform reliable null tests in future CMB missions."}
